{"augmentin 625 duo tablet": "Augmentin 625 Duo Tablet contains two medicines, Amoxycillin and Clavulanic Acid, that work together to kill the bacteria that cause infections. Amoxycillin works by stopping the growth of bacteria. Clavulanic Acid reduces resistance and enhances the activity of Amoxycillin against bacteria.29 Nov 2023", "azithral 500 tablet": "Azithromycin is a macrolide antibiotic belonging to the azalide group. The molecule is constructed by adding a nitrogen atom to the lactone ring of erythromycin A. The chemical name of azithromycin is 9-deoxy-9a-aza-9a-methyl-9a-homoerythromycin A. The molecular weight is 749.0.", "ascoril ls syrup": "Ascoril LS Syrup is a combination of three drugs: Ambroxol, Levosalbutamol, and Guaifenesin that relieves cough with mucus. Ambroxol is a mucolytic, which thins and loosens mucus (phlegm) to make coughing easier. Levosalbutamol is a bronchodilator used to open up the airways.", "allegra 120mg tablet": "Allegra 120mg tablet contains fexofenadine as an active ingredient. Fexofenadine works by blocking the effects of histamine, a substance that causes allergy symptoms. Take Allegra as advised by your doctor for the prescribed duration. You can take this medicine with or without food.28 Feb 2024", "avil 25 tablet": "Avil 25 MG Description\n\n It contains pheniramine as its active ingredient. Avil tablet works by blocking the production of chemicals that cause the symptoms of allergy. Allergy is your body's response to any substance which is usually harmless, such as pollen, dust, certain food, medicines or insect bites.26 Feb 2024", "allegra-m tablet": "Allegra-M Tablet is a combination of two medicines: Montelukast and Fexofenadine. This medicine is used to treat allergy symptoms like runny nose, sneeze and cough. It works by lowering the chemicals in the body that cause allergy symptoms.24 Aug 2021", "amoxyclav 625 tablet": "Amoxyclav 625 Tablet is a combination of two medicines: Amoxycillin and Clavulanic acid. It is used to treat bacterial infections like, tonsillitis, sinusitis, otitis media, respiratory tract infections, urinary tract infections, boils, abscesses, cellulitis, wound infection, bone infection, and oral cavity infections.", "azee 500 tablet": "Azee 500 MG Description\n\n This medicine contains azithromycin, which is a broad-spectrum antibiotic that can kill various bacteria responsible for the infection. It is important to take Azee 500 tablets exactly as prescribed by your doctor.19 Mar 2024", "atarax 25mg tablet": "ATARAX 25MG TABLET contains Hydroxyzine which belongs to the group of medicines called Antihistamines. It is used to treat allergic reactions (itching, sneezing), for anxiety and tension as well as for sedation (for inducing sleep in medical conditions and after anesthesia).", "ascoril d plus syrup sugar free": "Ascoril D Plus Syrup Sugar Free is a combination of three medicines: Phenylephrine, Chlorpheniramine Maleate, and Dextromethorphan Hydrobromide. Phenylephrine is a decongestant which narrows the small blood vessels providing relief from congestion or stuffiness in the nose.23 Jan 2024", "aciloc 150 tablet": "Aciloc 150 Tablet 30's contains ranitidine, a histamine-2 (H2) receptor blocker that helps reduce stomach acid by blocking the actions of the H2 receptor.", "alex syrup": "Alex Syrup is a combination medicine that contains Chlorpheniramine Maleate, Dextromethorphan, and Phenylephrine as active ingredients. Each of these ingredients works uniquely to provide relief from respiratory symptoms.", "anovate cream": "The salts Beclomethasone Dipropionate (0.025%), Phenylephrine Hydrochloride (0.1%), Lidocaine Hydrochloride (2.5%) are involved in the preparation of Anovate Cream.", "augmentin duo oral suspension": "5ml of oral suspension contains amoxicillin trihydrate equivalent to 400mg amoxicillin and potassium clavulanate equivalent to 57mg of clavulanic acid. Every ml of oral suspension contains 2.5 mg aspartame (E951).", "ambrodil-s syrup": "Ambrodil-S Syrup is a combination of Ambroxol and Salbutamol / Albuterol which relieve cough. Ambroxol is a mucolytic which thins and loosens mucus (phlegm), making it easier to cough out. Salbutamol is a bronchodilator which widens the airways by relaxing its muscles.", "arkamin tablet": "Arkamin contains clonidine as the active component. This medicine dilates the blood vessels and decreases high blood pressure. Arkamin tablet should be taken as directed by the doctor and in doses and duration as prescribed. Do not stop taking Arkamin medicine, as it results in a sudden spike in blood pressure levels.15 Jan 2023", "avomine tablet": "Avomine 25 MG Description\n\n It is also used for the treatment of nausea and vomiting caused due to motion sickness. Avomine contains promethazine as its active ingredient. Promethazine in tab Avomine works by opposing the action of histamine (natural substances produced in the body during allergic conditions).8 Feb 2024", "asthakind-dx syrup sugar free": "A: Asthakind-DX sugar-free syrup contains a combination of three medicines, namely chlorpheniramine, dextromethorphan and phenylephrine as active substances.29 Jan 2024", "allegra 180mg tablet": "ALLEGRA 180MG TABLET contains Fexofenadine which belongs to the group of medicines called Antihistamines. It is used in adults and children (aged above 12 years) to provide relief from symptoms of hay fever or seasonal allergic rhinitis.5 Jan 2023", "albendazole 400mg tablet": "Albendazole is a carbamate ester that is methyl 1H-benzimidazol-2-ylcarbamate substituted by a propylsulfanyl group at position 5. It is commonly used in the treatment of parasitic worm infestations. It has a role as a tubulin modulator, a microtubule-destabilising agent and an anthelminthic drug.", "asthalin syrup": "Asthalin AX Syrup is a combination of three medicines: Ambroxol, Levosalbutamol / Levalbuterol, Guaifenesin. It is used in the treatment of cough with mucus. Ambroxol is a mucolytic. It thins and loosens the mucus (phlegm) which makes it easier to cough out.29 Nov 2023", "alprax 0.25 tablet": "Alprax 0.25mg has alprazolam as its main ingredient. Alprax 0.25mg tablet enhances the effect of the chemical substance GABA, thereby reducing and inhibiting the abnormal and excessive nerve cells and nerve transmission within the brain.21 Sept 2021", "altraday capsule sr": "Altraday Capsule SR is a pain reliever that combines two medications: Aceclofenac and Rabeprazole. Aceclofenac is a nonsteroidal anti-inflammatory drug (NSAID) that works by blocking the release of chemical messengers that cause pain and inflammation (redness and swelling).", "ativan 2mg tablet": "Each Ativan (lorazepam) tablet, to be taken orally, contains 0.5 mg, 1 mg, or 2 mg of lorazepam. The inactive ingredients present are lactose monohydrate, magnesium stearate, microcrystalline cellulose, and polacrilin potassium.", "ascoril ls junior syrup": "Ascoril LS Junior Syrup is a combination of three medicines: Ambroxol, Levosalbutamol / Levalbuterol, Guaifenesin. It is used in the treatment of cough with mucus. Ambroxol is a mucolytic. It thins and loosens the mucus (phlegm) which makes it easier to cough out.", "asthalin 100mcg inhaler": "Asthalin inhaler contains salbutamol as its main ingredient whereas Foracort inhaler contains a combination of two medicines - formoterol and budesonide. Based on the severity of your condition your doctor will prescribe suitable medicine for your condition, avoid self medication.16 Feb 2024", "almox 500 capsule": "A: Yes, Almox 500 contains amoxicillin as an active ingredient. It is an antibiotic medicine used to treat bacterial infections like infection of the lungs, airways, tonsils and throat, skin and urinary tract infections.26 Apr 2023", "atarax 10mg tablet": "ATARAX 10MG TABLET contains Hydroxyzine which belongs to the group of medicines called Antihistamines. It is used to treat allergic reactions (itching, sneezing), for anxiety and tension as well as for sedation (for inducing sleep in medical conditions and after anesthesia).", "aciloc rd 20 tablet": "ACILOC RD 20 TABLET contains two medicines namely domperidone and omeprazole. Domperidone is a prokinetic medicine with anti-emetic properties. It works by blocking the actions of a chemical messenger called dopamine in the gut and across the brain and spinal cord.2 Nov 2022", "aldactone tablet": "It is a steroid lactone, an oxaspiro compound, a thioester and a 3-oxo-Delta(4) steroid. Spironolactone is a potassium-sparing diuretic. It binds to mineralocorticoid receptors and functions as aldosterone antagonists.", "allegra suspension raspberry & vanilla": "Allegra Suspension Raspberry & Vanilla: View Uses, Side Effects ...", "atarax syrup": "What form(s) does this medication come in? Each 5 mL of mint-flavoured syrup contains 10 mg of hydroxyzine hydrochloride and 1.5 mg of sodium benzoate. Nonmedicinal ingredients: sucrose, water, alcohol, menthol, spearmint oil, peppermint oil, and sodium hydroxide or hydrochloric acid (for pH adjustment).", "amlokind-at tablet": "AMLOKIND AT TABLET is a combination of Amlodipine and Atenolol which belongs to the group of medicine called Antihypertensive agents. It is used to treat hypertension (also known as high blood pressure) and angina pectoris (chest pain caused due to lack of oxygen supply to the heart).26 Feb 2024", "axcer  90mg tablet": "Axcer 90mg Tablet: View Uses, Side Effects, Price and Substitutes", "ativan 1mg tablet": "Ativan 1mg Tablet: View Uses, Side Effects, Price and Substitutes", "alkasol oral solution": "Alkasol Oral Solution 200 ml contains disodium hydrogen citrate, which metabolises to bicarbonate and increases the excretion of free bicarbonate ions; this increases the solubility of cysteine in the urine and ionises uric acid to soluble urate ion.", "aldigesic p 100mg/325mg tablet": "It contains aceclofenac and paracetamol as its active ingredients. Zerodol P tablet, Aceclo Plus tablet, Acenac P tablet and Acemiz Plus tablet are a few more tablets that also include aceclofenac and paracetamol as their active ingredients. Pain and inflammation are caused in response to an injury or harm.20 Mar 2024", "alfoo 10mg tablet pr": "INTRODUCTION ABOUT ALFOO 10MG TABLET\n\n ALFOO 10MG TABLET contains Alfuzosin which belongs to the group of medicines called Alpha-1-blockers. It is used to provide relief from moderate to severe symptoms of benign prostatic hyperplasia in affected individuals.26 Feb 2024", "alprax 0.5mg tablet": "A: ALPRAX 0.5MG TABLET contains Alprazolam, which belongs to the group of medicines called anxiolytics.26 Feb 2024", "arachitol 6l injection": "Arachitol 6L Injection 6X1 ml contains Vitamin-D3 (Cholecalciferol), a fat-soluble vitamin. It helps maintain blood calcium and phosphorus levels and the mineralization of bone. It is used to treat and prevent bone disorders, such as rickets and osteomalacia.", "anafortan 25 mg/300 mg tablet": "Anafortan 25 mg/300 mg Tablet - 1mg", "alex junior syrup": "Alex Junior Syrup 60ml Description\n\n It contains Chlorpheniramine and Dextromethorphan. Chlorpheniramine is an antiallergic medicine, whereas dextromethorphan is a cough suppressant. The common side effects of this medicine are drowsiness, sleepiness, upset stomach, dizziness.3 Jun 2022", "azithral 200 liquid": "AZITHRAL 200 LIQUID contains Azithromycin which belongs to the group of medicines called Macrolides. It is used in children to treat infections caused by bacteria and other micro-organisms which include chest, throat, and nasal infections such as bronchitis, pneumonia, tonsillitis, sore throat and sinusitis.26 Feb 2024", "ab phylline capsule": "AB Phylline Capsule comprises of theophylline-7 acetate and ambroxol which makes it effective in making the mucus more fluid and clearing the airways easily, thereby making breathing easier.22 Mar 2024", "althrocin 500 tablet": "Althrocin-500 Tablet 10's contains Erythromycin, which belongs to a class of drugs known as macrolide antibiotics. Macrolide antibiotics kill the bacterium that is causing the infection.", "augmentin dds suspension": "Augmentin DDS suspension contains amoxicillin and clavulanic acid. Amoxicillin works by killing the bacteria responsible for infections. However, the bacteria make the enzyme (beta-lactamases) which c. Clavulanic acid inactivates this enzyme and hence helps Amoxicillin to perform its function....30 Nov 2021", "azicip 500 tablet": "Azicip 500 contains azithromycin as its active ingredient. This medicine should be taken as directed by the doctor and in doses and duration as prescribed. Take Azicip 500 with food to avoid stomach upset.10 Jul 2023", "aldigesic-sp tablet": "Aldigesic-SP Tablet is a combination of three medicines: Aceclofenac, Paracetamol and Serratiopeptidase. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID), and Paracetamol is an antipyretic (fever reducer).29 Nov 2023", "amoxycillin 500mg capsule": "Structure for Amoxicillin (DB01060)(2S,5R,6R)-6-{[(2R)-2-amino-2-(4-hydroxyphenyl)acetyl]amino}-3,3-dimethyl-7-oxo-4-thia-1-azabicyclo[3.2.0]heptane-2-carboxylic acid.6-(p-hydroxy-α-aminophenylacetamido)penicillanic acid.Amox.Amoxicilina.Amoxicillin.Amoxicillin (anhydrous)Amoxicillin anhydrous.Amoxicilline.", "asthakind expectorant sugar free": "Asthakind is a combination medicine containing - bromhexine, guaifenesin and terbutaline. Bromhexine is a mucolytic agent, guaifenesin is an expectorant and terbutaline is a bronchodilator. Asthakind Expectorant sugar-free works by thinning, liquefying and loosening the mucus and makes expulsion easy.19 May 2023", "acemiz plus tablet": "Product Summary", "aceclo plus tablet": "Aceclo Plus Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling).29 Nov 2023", "anobliss cream": "It contains two active ingredients lidocaine and nifedipine that helps in better healing of the anal fissure. Anorelief cream, Fidonal cream, and Xylocaine NF cream also have lidocaine and nifedipine as their active ingredient. Do not use Anobliss if you have a history of allergies or any heart problems.19 May 2023", "alex cough lozenges lemon ginger": "Alex Cough Lozenges Lemon Ginger: View Uses, Side Effects ... - 1mg", "asthalin respules": "ASTHALIN RESPULE contains Salbutamol which belongs to the group of medicines called Bronchodilators. It is used to treat severe asthma attacks.30 Nov 2022", "avil injection": "Avil Injection 10 ml belongs to the class of medications called 'anti-histamine' primarily used to treat allergic reactions. Avil Injection 10 ml contains Pheniramine maleate, which works by blocking the action of a chemical messenger called 'histamine' responsible for causing allergic reactions.", "azee 200mg dry syrup": "AZEE 200MG DRY SYRUP contains Azithromycin which belongs to the group of medicines called Macrolides. It is used in children to treat infections caused by bacteria and other micro-organisms which include chest, throat, and nasal infections such as bronchitis, pneumonia, tonsillitis, sore throat and sinusitis.26 Feb 2024", "atorva tablet": "Atorva 10mg Tablet contains Atorvastatin 10mg that reduces the narrowing of blood vessels due to cholesterol by reducing bad cholesterol levels and increasing good cholesterol levels in the body thus preventing any risks of heart attack and stroke. Chemical Class: Pyrrole & heptanoic acid derivative. Addictive Drug: No.", "asthakind-ls expectorant cola sugar free": "Asthakind-LS Expectorant Cola Sugar Free - 1mg", "ascoril ls drops": "Ascoril LS Drops is a combination of three medicines: Ambroxol, Levosalbutamol, and Guaifenesin, which relieves cough with mucus. Ambroxol is a mucolytic that thins and loosens mucus (phlegm), making it easier to cough out. Levosalbutamol is a bronchodilator.29 Nov 2023", "azmarda 50mg tablet": "Azmarda 50mg Tablet is a combination of two medicines: Sacubitril and Valsartan which belong to a class of angiotensin receptor neprilysin inhibitor (ARNI). This combination treats heart failure by relaxing the blood vessels and making it easier for your heart to pump blood throughout your body.15 Jan 2024", "amixide-h tablet": "Amixide-H Tablet 10's is a combination of two drugs: Amitriptyline (tricyclic anti-depressant) and Chlordiazepoxide (benzodiazepine anxiolytic). Amitriptyline works by affecting certain chemical messengers in the brain that communicate between brain cells, thereby regulating mood and treating depression.", "ab-flo-n tablet": "AB-Flo-N Tablet is a combination of two medicines : Acebrophylline and Acetylcysteine. Acebrophylline is a mucolytic and bronchodilator. It works by relaxing the muscles of the airways and also thins and loosens mucus, making it easier to breathe. Acetylcysteine is a mucolytic medication.16 Feb 2024", "af kit tablet": "The salts Azithromycin (1000 mg),Ornidazole(750 mg),Fluconazole(150 mg) are involved in the preparation of AF Kit.", "amlokind 5 tablet": "Amlokind 5 Tablet contains Amlodipine 5mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives.", "amlong tablet": "Amlong A tablet contains a combination of amlodipine and atenolol as active substances. It works by lowering the blood pressure, heart rate, and contractility of heart muscles.19 Sept 2022", "akt 4 kit": "Product Summary", "ascoril d junior cough syrup": "Ascoril D Junior Syrup 60 ml is a combination of three drugs, namely: Chlorpheniramine (antihistamine), Phenylephrine (decongestant) and Dextromethorphan (cough suppressant). Chlorpheniramine works by blocking the action of histamine, a substance responsible for causing allergic reactions.", "amitone 10mg tablet": "Amitone 10mg Tablet contains Amitriptyline, a tricyclic antidepressant. It has anticholinergic and sedative properties. It prevents the reuptake, and hence the inactivation of neurotransmitters called noradrenaline and serotonin, that are present at the nerve terminals in our brain.29 Nov 2023", "aulin 100mg tablet": "Aulin 100 MG Tablet is a non-steroidal anti-inflammatory medicine (NSAID) that contains Nimesulide as an active ingredient. It is used to treat pain and fever.14 Sept 2021", "amikacin sulphate 500mg injection": "Amikacin Sulphate 500mg Injection: View Uses, Side Effects ... - 1mg", "ambrodil-lx syrup": "Ambrodil-LX Syrup 100 ml is a combination of three drugs, namely Levosalbutamol (bronchodilator), Ambroxol (mucolytic agent), and Guaifenesin (expectorant). Levosalbutamol belongs to the class of bronchodilators that works by relaxing muscles and widening the airways of the lungs.", "aquasol a capsule": "Clinical Pharmacology for Aquasol A\n\n Beta-carotene, retinol, and retinal have effective and reliable vitamin A activity. Retinal and retinol are in chemical equilibrium in the body and have equivalent antixerophthalmic activity.", "ab phylline sr 200 tablet": "AB Phylline SR 200 Tablet: View Uses, Side Effects, Price and ... - 1mg", "azoran tablet": "Azoran tablet is an immunosuppressant medicine. It reduces the strength of the immune system. It is used in the treatment of organ transplants and a few autoimmune diseases. This medicine contains azathioprine as its active substance.4 May 2023", "aztor 10 tablet": "Aztor 10 Tablet 15's contains 'Atorvastatin' which works by slowing the production of cholesterol in the body to decrease the amount of cholesterol that may build up on the arteries walls and block blood flow to the heart, brain, and other parts of the body.", "atorva 40 tablet": "ATORVA 40MG TABLET contains Atorvastatin which belongs to the group of medicines called Lipid-lowering drugs. It is used to reduce elevated high blood cholesterol levels (hyperlipidaemia) in patients when diet and lifestyle changes does not result in an adequate response.30 Sept 2022", "azax 500 tablet": "Azax 500 MG Description\n\n This tablet contains azithromycin as an active medicine. Azithromycin inhibits the growth of infection-causing bacteria, thus preventing the spread of infection. This should be taken as directed by the doctor and in doses and duration as prescribed.12 Jul 2023", "alex syrup sugar free": "Alex Syrup Sugar Free: View Uses, Side Effects, Price and Substitutes", "anxit 0.5 tablet": "Anxit 0.5 mg drug belongs to the benzodiazepines class, used to treat anxiety and panic disorders. They are benzodiazepines, which calm the nervous system by acting on the brain. This is accomplished. Anxit 0.5 mg contains alprazolam 0.25mg as its active ingredient.24 Jan 2022", "anxit 0.25mg tablet": "The composition of Anxit 0.25 mg tablet is Alprazolam 0.25mg. It acts by blocking chemicals that make you feel stressed and reducing feelings of anxiety and worry. Anxit 0.25 mg tablets treat panic episodes, generally characterised by difficulty in breathing, weakness, and numbness of hands and feet.24 Jan 2022", "acitrom 2 tablet": "Acitrom 2 mg tablet contains Acenocoumarol which is structurally similar to vitamin K. Vitamin K is an essential factor required for blood clotting. Acenocoumarol inhibits the action of an enzyme which maintains the adequate levels of vitamin K required for blood clotting....17 Aug 2021", "angispan - tr 2.5mg capsule": "The active ingredient in Angispan-TR Capsule is nitroglycerin/glyceryl trinitrate. Nitroglycerin/glyceryl trinitrate works by relaxing the smooth muscles within the blood vessels. This relaxation leads to the widening of blood vessels, which improves blood supply to the muscles of the heart.27 Aug 2023", "azeflo nasal spray": "Azeflo Nasal Spray is a combination of two medicines: Fluticasone Propionate and Azelastine, which relieves sneezing and runny nose caused due to allergies (allergic rhinitis).16 Feb 2024", "acemiz -mr tablet": "A: ACEMIZ PLUS TABLET is a combination of Aceclofenac and Paracetamol as active ingredients. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAIDs). It works by inhibiting the production of certain chemicals in the body, specifically prostaglandins.24 Feb 2024", "akurit 4 tablet": "Akurit 4 is composed of four anti-tuberculosis medications, namely rifampicin, isoniazid, pyrazinamide and ethambutol. Isoniazid prevents the Mycobacterium tuberculosis from forming a protective cover. Ethambutol and pyrazinamide together slow the growth of the bacteria.3 Feb 2022", "aerocort inhaler": "Aerocort Inhaler is a combination of two medicines: Levosalbutamol and Beclometasone. Levosalbutamol is a bronchodilator which works by relaxing the muscles in the airways and widens the airways. Beclometasone is a steroid medicine.29 Nov 2023", "adaferin gel": "Skim through", "acivir 400 dt tablet": "Acivir 400 DT Tablet: View Uses, Side Effects, Price and Substitutes", "aptimust syrup": "Aptimust Syrup 200 ml combines three medicines: cyproheptadine, sorbitol, and tricholine.", "augmentin 1000 duo tablet": "Augmentin 1000 Duo Tablet contains two medicines, Amoxycillin and Clavulanic Acid, that work together to kill the bacteria that cause infections. Amoxycillin works by stopping the growth of bacteria. Clavulanic Acid reduces resistance and enhances the activity of Amoxycillin against bacteria.22 Mar 2024", "ambrodil syrup": "Ambrodil-S Syrup is a combination of Ambroxol and Salbutamol / Albuterol which relieve cough. Ambroxol is a mucolytic which thins and loosens mucus (phlegm), making it easier to cough out. Salbutamol is a bronchodilator which widens the airways by relaxing its muscles.", "acogut tablet": "Acogut Tablet contains the active ingredient acotiamide, which increases the concentration of a chemical called acetylcholine. This enhances gastrointestinal movement, leading to improved intestinal motility, faster gastric emptying and better food movement throughout the gastrointestinal tract.31 Jan 2024", "atarax drops": "Atarax Drops 15 ml contains Hydroxyzine, which is primarily used to treat allergic reactions. Hydroxyzine is an antihistamine; it reduces the effect of the chemical histamine in the body by blocking histamine receptors' action.", "amlip 5 tablet": "Amlip-5 Tablet 10's contains Amlodipine, a calcium channel blocker that acts by relaxing the blood vessels. This reduces the workload on the heart and makes the heart more efficient at pumping blood throughout the body. Thus, it helps to lower high blood pressure, reducing the chances of heart attack or stroke.", "antid 300mcg/ml injection": "Anti D 300mcg injection contains active components called Anti-Rh(D) immunoglobulin. It is a medication used to prevent Rh(D) hemolytic disease of the newborn (HDN). This condition can occur when an Rh-negative mother carries an Rh-positive baby.26 Jan 2024", "alerid syrup": "Alerid 5 MG/5ML Description\n\n It contains cetirizine, an anti-allergic medicine. Cetirizine blocks histamine, which is a natural chemical substance responsible for allergic conditions. The dose of Alerid syrup varies in children based on their age group.15 May 2023", "aldactone 50 tablet": "Aldactone 50 Tablet: View Uses, Side Effects, Price and Substitutes", "ampoxin 500 capsule": "Ampoxin 500 Capsule is a combination of two antibiotics, Ampicillin and Cloxacillin. These antibiotics work by preventing the formation of the bacterial protective covering which is essential for the survival of bacteria. Together, they treat your infection effectively.", "azee 250 tablet": "Azee 250 contains azithromycin as its active component. It works by destroying the bacteria that cause infection and inhibits the growth of new bacteria. Azithral 250 tablets, Azicip 250 tablets, Azax 250 tablets and Azithral DT 250 tablets have Azithromycin active ingredients.16 May 2023", "alerid tablet": "Alerid Tablet 10's contains cetirizine (anti-histamine), which is used to treat allergies as it blocks the effects of a chemical messenger known as 'histamine,' which is naturally involved in allergic reactions.", "augmentin 375 tablet": "Each film-coated tablet contains amoxicillin trihydrate equivalent to 250 mg amoxicillin and potassium clavulanate equivalent to 125 mg of clavulanic acid.", "acenac-p  tablet": "Acenac-P Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling).29 Nov 2023", "acivir cream": "Acivir 5 % Description\n\n It contains acyclovir (aciclovir) as its active ingredient. It is meant only for external application and should be applied exactly as recommended by your doctor.9 May 2022", "ab-flo capsule": "AB-flo Capsule 10's contains Acebrophylline that works by relaxing muscles and widening the airways of the lungs. Additionally, AB-flo Capsule 10's also acts as mucolytic (cough/sputum thinner) agent and helps in thinning and loosening phlegm (mucus) in lungs, windpipe and nose.", "ab phylline n tablet": "AB Phylline N Tablet is a combination of two medicines : Acebrophylline and Acetylcysteine. Acebrophylline is a mucolytic and bronchodilator. It works by relaxing the muscles of the airways and also thins and loosens mucus, making it easier to breathe. Acetylcysteine is a mucolytic medication.29 Nov 2023", "amifru 40 tablet": "INTRODUCTION. AMIFRU 40/5 TABLET is a combination of Amiloride and Furosemide which belongs to the group of medicines called Diuretics. It is used in the treatment of extra build-up of water in the body. Symptoms include swollen ankles, feeling more tired than usual and shortness of breath.16 Dec 2022", "avamys nasal spray": "Avamys contains the active ingredient fluticasone furoate. Avamys also contains glucose anhydrous, dispersible cellulose, polysorbate 80, benzalkonium chloride, disodium edetate, and purified water. Pharmaceutical companies are not in a position to give people an individual diagnosis or medical advice.", "alkasol oral solution sugar free": "About Alkasol 1.4 GM Sugar Free Liquid 100 ML\n\n The composition of Alkasol Syrup includes disodium hydrogen citrate (1.4 g per 5 ml). The sugar-free formulation of this syrup is beneficial for diabetics or those following a sugar-restricted diet. Alkasol Liquid is safe when prescribed by a doctor.9 Feb 2024", "aciloc 300 tablet": "A: Aciloc 300 tablets are used in the treatment of stomach and intestinal ulcers, heartburn, indigestion and gastroesophageal reflux disease. It contains ranitidine as its active ingredient. Aciloc RD tablet contains a combination of domperidone and omeprazole.28 Feb 2024", "aziderm 20% cream": "Information about BRIGHTENING Aziderm 20% CreamMain Ingredients: Azelaic Acid Topical (20% w/w)Key Function: De-pigmentation mask, brightening, reduces dark spots.Suitable for: All skin types Ages 18+Side effects to look for: redness, burning, allergic reaction.", "ace proxyvon tablet": "Product Summary", "ano metrogyl cream": "Ano Metrogyl Cream is a combination of three medicines: Lidocaine, Metronidazole and sucralfate. Lidocaine is a local anesthetic. It works by blocking pain signals from the nerves to the brain which decreases pain sensation.19 Feb 2024", "admenta 5 tablet": "ADMENTA 5MG TABLET contains Memantine which belongs to the group of medicines called Anti-dementia drugs. It is used to treat moderate to severe Alzheimer's disease. Alzheimer's disease is a neurodegenerative disease that destroys memory and other important mental functions in an individual.29 Sept 2022", "aceclo-mr tablet": "Product Summary", "alerid-d tablet": "Alerid-D tablet contains cetirizine and phenylephrine as active substances. Cetirizine works by opposing the action of a substance called histamine that is responsible for causing allergic symptoms. Phenylephrine works by narrowing the blood vessels causing relief in nasal blockage.26 Oct 2023", "acemiz-s tablet": "Acemiz-S Tablet is a combination of three medicines: Aceclofenac, Paracetamol and Serratiopeptidase. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID), and Paracetamol is an antipyretic (fever reducer). They work by blocking the release of certain chemical messengers in the brain that cause pain and fever.16 Feb 2024", "allercet-dc tablet": "Allercet-DC tablet contains cetirizine and phenylephrine as active substances. Cetirizine works by opposing the action of a substance called histamine, a chemical formed in the body in certain allergic conditions. Phenylephrine works by narrowing blood vessels causing relief in nasal congestion.6 May 2023", "aztolet  10 tablet": "Product Summary", "augmentin 1.2gm injection": "Augmentin 1.2gm Injection: View Uses, Side Effects, Price and ... - 1mg", "ambrodil-plus rf syrup": "AMBRODIL PLUS RF SYRUP contains ambroxol, chlorpheneramine maleate, and pseudoephedrine. Ambroxol is a mucolytic agent that manages the excess secretion of mucus, lowers phlegm viscosity, and improves the mucociliary transport of bronchial secretions.10 Mar 2023", "amlopres-at tablet": "Amlopres At (5/50 mg) Tablet is composed of Amlodipine and Atenolol. Amlodipine works by relaxing the heart muscles and blood vessels. Atenolol blocks certain substances (catecholamines) which increases blood pressure.23 Aug 2021", "ajaduo 25mg/5mg tablet": "Ajaduo 25mg/5mg Tablet is a combination of two antidiabetic medicines: Empagliflozin and Linagliptin. Empagliflozin works by removing excess glucose from your body through urine.16 Feb 2024", "avanair 100 tablet": "Avanair 100 Tablet: View Uses, Side Effects, Price and Substitutes", "acton-or tablet sr": "Acton-OR Tablet SR: View Uses, Side Effects, Price and Substitutes", "aquazide 12.5 tablet": "AQUAZIDE 12.5MG TABLET contains Hydrochlorothiazide which belongs to the group of medicines called Diuretics. It is as an adjuvant therapy in treating edema (fluid accumulation) that is caused due to heart failure, liver inflammation (Ex. liver cirrhosis), kidney problems or due to intake of steroid medications.14 Feb 2023", "alaspan am tablet": "Q: What does Alaspan tablet contain? A: Alaspan AM tablet contains a combination of loratadine and ambroxol as their active ingredients.18 Apr 2022", "althrocin 250 tablet": "Althrocin 250 tablet is an antibiotic medicine that is used to prevent and treat a wide variety of bacterial infections. It contains erythromycin as its active ingredient. It works by inhibiting the growth of bacteria responsible for the infection. Usually, this medicine is used for short-term treatment.6 May 2023", "azikem 500mg tablet": "A: The composition of Azikem Tablet is azithromycin as its active ingredient.6 May 2022", "aldosmin 500mg tablet": "Aldosmin 500mg Tablet: View Uses, Side Effects, Price and ... - 1mg", "amlovas 5 tablet": "Amlovas 5 Tablet contains Amlodipine 5mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives. Addictive Drug: No.", "acitrom 1 tablet": "Acitrom 1 tablet contains acenocoumarol which is structurally similar to vitamin K. Vitamin K is an essential factor required for blood clotting. Acenocoumarol inhibits the action of an enzyme which maintains the adequate levels of vitamin K required for blood clotting....25 May 2023", "af 150 tablet dt": "AF 150 Tablet DT: View Uses, Side Effects, Price and Substitutes | 1mg", "ascoril sf expectorant": "Ascoril SF Expectorant 100 ml is a combination of three drugs, namely Guaiphenesin (expectorant), Terbutaline sulphate (bronchodilator) and Bromhexine hydrochloride (mucolytic agent or cough thinner).", "amaryl m  1mg tablet pr": "Amaryl M 1mg Tablet PR is a combination of two antidiabetic medicines: Glimepiride and Metformin. Glimepiride is a sulfonylurea which works by increasing the amount of insulin released by the pancreas in order to lower the blood glucose.", "azithral xl 200 liquid": "Product Summary", "af 400 tablet": "About AF-400 Tablet 1's\n\n AF-400 Tablet 1's contains 'Fluconazole' that kills or prevents fungi or yeast by inhibiting an enzyme in fungi responsible for its normal fat metabolism, which interferes with the formation of the fungal cell membrane.", "amantrel tablet": "Amantrel tablet contains amantadine as the active substance. It is used in the management of Parkinson's disease. It is also used for the treatment of movement disorders caused by certain medicines. Take Amantrel tablet in the exact dose and duration as prescribed by your doctor.29 Jun 2022", "atorva 20 tablet": "Atorva 20 Tablet contains Atorvastatin 20mg which reduces the narrowing of blood vessels due to cholesterol by reducing bad cholesterol levels and increasing good cholesterol levels in the body thus preventing any risks of heart attack and stroke. Chemical Class: Pyrrole & heptanoic acid derivative.", "acenac-mr tablet": "Acenac-MR Tablet 10's is a combination of three drugs, namely: Thiocolchicoside, Aceclofenac, and Paracetamol. Acenac-MR Tablet 10's is used to relieve pain and inflammation associated with osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, muscle pain, bone and joint pain.", "ambrolite-s expectorant": "Product Summary", "asthalin 4 tablet": "Asthalin-4 Tablet 30's contains 'Salbutamol,' which is a β₂ adrenergic receptor agonist. It relaxes the muscles in the airways and increases airflow to the lungs.", "abiways tablet": "Abiways Tablet is a combination of two medicines : Acebrophylline and Acetylcysteine. Acebrophylline is a mucolytic and bronchodilator. It works by relaxing the muscles of the airways and also thins and loosens mucus, making it easier to breathe. Acetylcysteine is a mucolytic medication.29 Nov 2023", "amaryl m  2mg tablet pr": "Amaryl M Tablet is an oral anti-diabetic medicine. It contains glimepiride and metformin as its active ingredient. It is used for the treatment of type 2 diabetes mellitus, a condition where blood sugar level rises above the normal range and cannot be controlled by diet and exercise alone.6 May 2023", "ampilox capsule": "Ampilox Capsule is a combination of two antibiotics: Ampicillin and Dicloxacillin. These antibiotics work by preventing the formation of the bacterial protective covering which is essential for the survival of bacteria. Together, they treat your infection effectively.", "adrenaline tartrate injection": "Adrenaline Tartrate Injection contains a hormone called adrenaline, that stimulates the heart and promotes blood flow. It is a proven life-saving treatment for people whose heart s have stopped working all of a sudden due to an emergency condition called cardiac arrest.29 Nov 2023", "acogut 300 er tablet": "Acogut 300 ER Tablet: View Uses, Side Effects, Price and Substitutes", "acuvin tablet": "Acuvin Tablet contains acetaminophen/paracetamol and tramadol. Analgesics are pain relievers like acetaminophen/paracetamol that prevent the release of particular chemical messengers causing pain. Tramadol is a pain reliever that reduces pain perception by inhibiting the transmission of pain signals to the brain.27 Jun 2022", "ab-flo sr tablet": "AB-Flo SR Tablet comprises of theophylline-7 acetate and ambroxol which makes it effective in making the mucus more fluid and clearing the airways easily, thereby making breathing easier.22 Mar 2024", "air-m tablet": "Air-M Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "atorlip-f tablet": "Atorlip F Tablet 15's is composed of two medicines, namely: Atorvastatin (HMG-CoA reductase inhibitor) and Fenofibrate (fibrates). Atorvastatin is a lipid-lowering medication that blocks the enzyme HMG-CoA reductase required to make cholesterol in the body.", "advent forte 457mg syrup tangy orange": "Advent Forte 457mg Syrup Tangy Orange - 1mg", "amlodac 5 tablet": "Amlodac 5 Tablet 30's contains Amlodipine, a calcium channel blocker that acts by relaxing the blood vessels. This reduces the workload on the heart and makes the heart more efficient at pumping blood throughout the body. Thus, it helps to lower high blood pressure, reducing the chances of heart attack or stroke.", "aztor 40 tablet": "AZTOR 40MG TABLET contains Atorvastatin which belongs to the group of medicines called Lipid-lowering drugs. It is used to reduce elevated high blood cholesterol levels (hyperlipidaemia) in patients when diet and lifestyle changes does not result in an adequate response.30 Sept 2022", "ascoril plus expectorant": "Q: What is the composition of Ascoril Plus? A: The composition of Ascoril plus consists of bromhexine, guaifenesin, menthol and terbutaline, as its active ingredients. Collectively these ingredients help in making your breath easier when your nose, lungs are filled with thick mucous.14 Dec 2022", "alupent 10mg tablet": "Alupent 10mg Tablet: View Uses, Side Effects, Price and Substitutes", "amlip at tablet": "Amlip At (5/50 mg) Tablet is composed of Amlodipine and Atenolol. Amlodipine works by relaxing the heart muscles and blood vessels. Atenolol blocks certain substances (catecholamines) which increases blood pressure.23 Aug 2021", "asthakind-p drops": "Asthakind P Drops 15 ml is a combination of three drugs, namely: Ambroxol, Guaifenesin, and Terbutaline. Ambroxol belongs to the class of mucolytic agents (cough/sputum thinner) that work by thinning and loosening phlegm (mucus) in the lungs, windpipe, and nose for coughing out easily.", "allegra nasal spray": "Allegra Nasal Duo Spray is a combination of two medicines. Fluticasone Furoate is a steroid that works by blocking the production of certain chemical messengers in the body that cause inflammation (redness and swelling) and allergies. Azelastine is an antihistaminic medication.29 Nov 2023", "addnok 0.2mg tablet": "Addnok Sublingual tablet: View Uses, Side Effects, Price and ... - 1mg", "aldosmin 1000mg tablet": "Aldosmin 1000mg Tablet: View Uses, Side Effects, Price and ... - 1mg", "andre i-kul eye drop": "Andre I-Kul Eye Drop: View Uses, Side Effects, Price and Substitutes", "antiflu 75mg capsule": "It contains oseltamivir as an active ingredient. It acts by stopping the growth and thus killing the virus and thus preventing the spread of the virus. This medicine should be used only by adults and children above 14 years of age. Antiflu tablet is consumed with food to avoid an upset stomach.26 Oct 2023", "alerfix total tablet sr": "Alerfix Total Tablet SR is a combination of three medicines: Ambroxol, Levocetirizine and Montelukast. Ambroxol is a mucolytic which thins and loosens mucus (phlegm), making it easier to cough out. Levocetirizine is an antiallergic which relieves allergy symptoms like runny nose, watery eyes and sneezing.29 Nov 2023", "alex-l cough syrup mango": "Alex-L Cough Syrup Mango: View Uses, Side Effects, Price ... - 1mg", "atropine sulphate injection": "Atropine Sulfate Injection, USP is a sterile solution of atropine sulfate in Water for Injection. Each mL contains Atropine Sulfate 0.4 mg; Sodium Chloride 9 mg; Benzyl Alcohol 9 mg; Water for Injection qs; pH may be adjusted with Sulfuric Acid if necessary. pH 3.0-6.5.", "aquaviron injection 1ml": "Aquaviron Injection 1ml is an injectable preparation which contains a synthetic form of testosterone (a male sex hormone). It is used in the treatment of male hypogonadism (a condition in which the body does not produce enough testosterone).22 Mar 2024", "aciclovir 400 tablet": "PACKAGE LABEL.PRINCIPAL DISPLAY PANEL", "alkof dx syrup": "Alkof DX Syrup is a combination of two medicines: Chlorpheniramine Maleate and Dextromethorphan Hydrobromide, which relieves dry cough. Chlorpheniramine Maleate is an antiallergic which helps reduce cough associated with allergies by blocking the effects of a chemical messenger, histamine.23 Jan 2024", "atm 500 tablet": "Atm 500 MG Description\n\n It contains azithromycin as its active ingredient. This medicine should be taken as directed by the doctor and in doses and duration as prescribed. It can be taken with or without food.19 May 2022", "assurans tablet": "ASSURANS TABLET contains Sildenafil which belongs to the group of medicines called Phosphodiesterase type 5 (PDE 5) inhibitors. It is used for pulmonary arterial hypertension (PAH) in adults and children.29 Nov 2023", "ambrolite d syrup": "Ambrolite D Syrup is a combination of three medicines: Phenylephrine, Chlorpheniramine Maleate, and Dextromethorphan Hydrobromide. Phenylephrine is a decongestant which narrows the small blood vessels providing relief from congestion or stuffiness in the nose.23 Jan 2024", "actrapid hm 100iu/ml penfill": "Actrapid HM Penfill (3ml Each): View Uses, Side Effects, Price ... - 1mg", "aten 50 tablet": "ATEN 50MG TABLET contains Atenolol, which belongs to the group of medicines called Beta-blockers. It is used to treat high blood pressure and arrhythmias (uneven heart beats). It can also be used to prevent angina (chest pain) and protect the heart in the initial treatment after a heart attack.8 Oct 2022", "azmarda 100mg tablet": "Azmarda 100mg Tablet is a combination of two medicines: Sacubitril and Valsartan which belong to a class of angiotensin receptor neprilysin inhibitor (ARNI). This combination treats heart failure by relaxing the blood vessels and making it easier for your heart to pump blood throughout your body.", "asthalin ax syrup": "Asthalin AX Syrup is a combination of three medicines: Ambroxol, Levosalbutamol / Levalbuterol, Guaifenesin. It is used in the treatment of cough with mucus. Ambroxol is a mucolytic. It thins and loosens the mucus (phlegm) which makes it easier to cough out.29 Nov 2023", "alzolam 0.5mg tablet": "It is composed of alprazolam 0.5 mg. Alprazolam belongs to a class of benzodiazepines. This class of medication works by balancing the chemical substances in the brain, which slows down brain activity and relaxes the overworked nervous system.27 Jan 2022", "a kare combipack": "A Kare Combipack is a combination of two medicines: Mifepristone and Misoprostol, which causes abortion. Mifepristone blocks the effects of progesterone, a natural female hormone that is needed for the pregnancy to sustain.6 Dec 2023", "ambulax tablet": "Ambulax Tablet is a combination of two medicines: Alprazolam and Propranolol. Alprazolam is a benzodiazepine. It works by increasing the action of GABA, a chemical messenger which suppresses the abnormal and excessive activity of the nerve cells in brain.6 Dec 2023", "amlovas-at tablet": "Amlovas AT Tablet 15's contains Amlodipine (a calcium channel blocker) and Atenolol (a beta-blocker). Amlodipine acts by relaxing and widening the constricted blood vessels. This ultimately reduces the heart's workload and makes the heart more efficient at pumping blood throughout the body.", "asthakind-dx junior syrup cherry": "Asthakind-DX Junior Syrup Cherry: View Uses, Side Effects ... - 1mg", "advent 228.5mg dry syrup": "Advent 228.5mg Dry Syrup comprises two active ingredients, amoxycillin and clavulanic acid. While clavulanic acid stops the enzyme from rendering amoxycillin ineffective, amoxycillin works towards killing the tuberculosis-causing bacteria.22 Mar 2024", "acivir 800 dt tablet": "Acivir 800 DT Tablet: View Uses, Side Effects, Price and Substitutes", "alfusin tablet pr": "ALFUSIN 10MG TABLET contains Alfuzosin which belongs to the group of medicines called Alpha-1-blockers. It is used to provide relief from moderate to severe symptoms of benign prostatic hyperplasia in affected individuals.26 Feb 2024", "aziwok 500 tablet": "Aziwok 500 Tablet: View Uses, Side Effects, Price and Substitutes", "alkacitral liquid": "Alkacitral 1.25 MG/5ML Description\n\n It contains disodium hydrogen citrate as the active substance. This syrup alkalizes urine by increasing its pH. This increases the solubility of uric acid and removes it from the body through urine.14 Jul 2023", "almox-cv 625 tablet": "Almox-CV 625 Tablet contains two medicines, Amoxycillin and Clavulanic Acid, that work together to kill the bacteria that cause infections. Amoxycillin works by stopping the growth of bacteria. Clavulanic Acid reduces resistance and enhances the activity of Amoxycillin against bacteria.22 Mar 2024", "azithral 100 liquid": "Azithral 100 Liquid: View Uses, Side Effects, Price and Substitutes", "azee 100mg dry syrup peppermint": "Azee 100mg Dry Syrup Peppermint: View Uses, Side Effects ... - 1mg", "ace-proxyvon cr tablet": "Ace-Proxyvon CR Tablet is a combination of two medicines: Aceclofenac and Rabeprazole, which relieves pain. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID) which works by blocking the release of certain chemical messengers that cause pain and inflammation (redness and swelling).22 Mar 2024", "ascoril c  syrup": "Ascoril C Syrup consists of two active components: chlorpheniramine and codeine. Chlorpheniramine belongs to the class of antihistamine, which helps in lowering allergy reactions. Codeine is a narcotic cough suppressant, which blocks the signals responsible for the stimulus that causes cough.3 Jun 2022", "aprezo 30mg tablet": "Aprezo 30 Tablet contains apremilast as its active ingredient. Apremilast works by blocking certain chemical messengers responsible for inflammation associated with psoriatic arthritis and psoriasis.12 Sept 2023", "apidra 100iu cartridge": "The active ingredient in Apidra 100IU Cartridge 3 ml is insulin glulisine. Apidra 100IU Cartridge 3 ml is a recombinant human insulin analogue that is equipotent to regular human insulin. Insulin glulisine has a more rapid onset of action and a shorter duration of action than regular human insulin.", "amlosafe 3d tablet": "Amlosafe 3D Tablet is a combination of three medicines: Telmisartan, Amlodipine and Hydrochlorothiazide. Telmisartan is an angiotensin receptor blocker (ARB) and Amlodipine is a calcium channel blocker (CCB). They work by widening and relaxing the blood vessels, thereby lowering blood pressure.", "andial 2mg tablet": "Andial 2mg tablet contains loperamide, an antidiarrhoeal medicine. It decreases the frequency of stools. It is not suitable for all types of diarrhoea. Stop taking it once you get relief from diarrhoea.4 May 2023", "acenext p 100mg/325mg tablet": "Acenext P 100mg/325mg Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling).29 Nov 2023", "acnesol a nano gel": "Acnesol A Nano Gel is a combination of two medicines: Adapalene and Clindamycin, which treats pimples (acne).22 Mar 2024", "ascoril flu syrup": "The active ingredients of Ascoril Flu Syrup 60ml are Chlorpheniramine Maleate 2mg and Phenylephrine 5mg/5ml.", "asomex 2.5 tablet": "Asomex AT 2.5 mg tablet contains S-Amlodipine, which belongs to the class of medications known as calcium channel blockers. It works by regulating the blood pressure by relaxing blood vessels and norm. This reduces the pressure on blood vessels and allows the blood to flow easily throughout the body.21 Apr 2022", "angiplat 2.5 capsule tr": "Angiplat 2.5 Capsule TR: View Uses, Side Effects, Price and ... - 1mg", "alkof cofgel  tablet": "Alkof Cofgels Capsule contains guaifenesin, bromhexine, and dextromethorphan. Guaifenesin is an expectorant that helps to remove mucus (phlegm) from the airways by reducing its stickiness. Bromhexine is a mucolytic, meaning it thins and loosens mucus (phlegm) to make coughing easier.9 Feb 2023", "azithral 250mg dt tablet": "Azithral 250mg DT Tablet: View Uses, Side Effects, Price and ... - 1mg", "alzolam 0.25mg tablet": "Alzolam 0.25 Tablet: View Uses, Side Effects, Price and Substitutes", "advent 625 tablet": "Advent 625 Tablet contains two medicines, Amoxycillin and Clavulanic Acid, that work together to kill the bacteria that cause infections. Amoxycillin works by stopping the growth of bacteria. Clavulanic Acid reduces resistance and enhances the activity of Amoxycillin against bacteria.29 Nov 2023", "alsita m 50mg/500mg tablet": "ALSITA M 50/500 Tablet 10's - Price, Uses, Side Effects | Netmeds", "axogurd-sr tablet": "Axogurd-SR Tablet is a combination of two medicines: Methylcobalamin and Pregabalin. Methylcobalamin is a form of vitamin B which helps in the production of myelin, a substance that protects nerve fibers and rejuvenates damaged nerve cells.22 Mar 2024", "azoflox uti tablet": "Azoflox UTI Tablet: View Uses, Side Effects, Price and Substitutes", "azulix 2 mf tablet pr": "Azulix 2 MF Tablet PR is a combination of two medicines: Glimepiride and Metformin. This medicine is used in the treatment of type 2 diabetes mellitus (DM). It improves blood glucose levels in adults when taken along with proper diet and regular exercise.29 Nov 2023", "amaryl mv 2mg tablet sr": "Amaryl MV 2mg Tablet SR is a combination of three medicines: Glimepiride, Metformin and Voglibose. This medicine is used in the treatment of type 2 diabetes mellitus (DM). It improves the blood glucose levels in adults when taken along with proper diet and regular exercise.29 Nov 2023", "azulix 1 mf tablet pr": "Azulix 1 MF Tablet PR is a combination of two medicines: Glimepiride and Metformin. This medicine is used in the treatment of type 2 diabetes mellitus (DM). It improves blood glucose levels in adults when taken along with proper diet and regular exercise.29 Nov 2023", "aten 25 tablet": "ATEN 25MG TABLET contains Atenolol, which belongs to the group of medicines called Beta-blockers. It is used to treat high blood pressure and arrhythmias (uneven heart beats).8 Oct 2022", "azibact 500 tablet": "Azibact 500 MG Description\n\n It contains azithromycin as its active ingredient. This medicine should be taken as directed by the doctor and in doses and duration as prescribed. It can be taken with or without food.6 May 2022", "amlopres tl tablet": "Amlopres TL Tablet is a combination of two medicines: Telmisartan and Amlodipine. Telmisartan is an angiotensin receptor blocker (ARB) and Amlodipine is a calcium channel blocker (CCB). They work by relaxing the blood vessels and making the heart more efficient at pumping blood throughout the body.22 Mar 2024", "ambrolite syrup": "It contains a combination of ambroxol, guaiphenesin, menthol, and terbutaline as its active ingredients. This medicine helps in the expulsion of mucous and reduces cough and breathlessness. This syrup should be used cautiously if you have liver or kidney-related problems.24 May 2022", "actapro tablet": "ACTAPRO 100MG TABLET contains Acotiamide, which belongs to the group of medicines called Gastro-intestinal agents. It is used in the treatment of functional dyspepsia. Functional dyspepsia is a chronic functional disorder of the upper digestive system that affects sensation and movement.1 Dec 2022", "aztor 20 tablet": "Aztor 20 Tablet contains Atorvastatin 20mg which reduces the narrowing of blood vessels due to cholesterol by reducing bad cholesterol levels and increasing good cholesterol levels in the body thus preventing any risks of heart attack and stroke. Chemical Class: Pyrrole & heptanoic acid derivative.", "alkof syrup": "Alkof Syrup is a combination of three medicines: Guaifenesin, Terbutaline and Bromhexine, which relieves cough with mucus.29 Nov 2023", "atorfit cv 10 capsule": "Atorfit CV 10 capsule is a combination medicine containing atorvastatin and clopidogrel. It is used to lower the lipid or cholesterol in the blood along with a low-fat diet and lifestyle changes. It is also used to reduce the risk of blood clot formation thus aiding in preventing a heart attack, stroke, etc.12 May 2023", "acnesol gel": "Acnesol A Nano Gel is a combination of two medicines: Adapalene and Clindamycin, which treats pimples (acne).22 Mar 2024", "amtas 5 tablet": "Amtas-5 Tablet 30's contains Amlodipine, a calcium channel blocker that acts by relaxing the blood vessels. This reduces the workload on the heart and makes the heart more efficient at pumping blood throughout the body. Thus, it helps to lower high blood pressure, reducing the chances of heart attack or stroke.", "alrgee 120mg tablet": "ALRGEE 120 TABLET contains Fexofenadine which belongs to the group of medicines called Antihistamines. It is used in adults and children (aged above 12 years) to provide relief from symptoms of hay fever or seasonal allergic rhinitis.5 Jan 2023", "avil 50mg tablet": "About Avil 50mg Tablet\n\n The active constituent of this medication is an alkylamine derivative, a histamine H1-receptor antagonist with anticholinergic and moderate sedative effects. Besides all of its uses, it is also found in eyedrops used to treat allergic conjunctivitis.", "arip mt 5 tablet": "Arip MT 5 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "alivher tablet": "Alivher Tablet contains sildenafil, a medicine that belongs to a group called phosphodiesterase type 5 (PDE 5) inhibitors. It works by relaxing the blood vessels, allowing increased blood flow to the penis, which helps in achieving and maintaining an erection.30 Aug 2023", "apdrops lp  eye drop bak free": "Apdrops LP Eye Drop BAK Free - 1mg", "amrox-ls syrup": "Amrox-LS Syrup is a combination of three medicines: Ambroxol, Levosalbutamol / Levalbuterol, Guaifenesin. It is used in the treatment of cough with mucus. Ambroxol is a mucolytic. It thins and loosens the mucus (phlegm) which makes it easier to cough out.19 Jan 2024", "altonil 3mg tablet": "Altonil 3mg Tablet: View Uses, Side Effects, Price and Substitutes", "allercet cold tablet": "Allercet Cold Tablet 10's is primarily used to treat common cold symptoms and reduces symptoms of allergies. It is composed of three medicines, namely Levocetirizine (antihistamine), Phenylephrine (decongestant), and Paracetamol (analgesic and antipyretic).", "atorlip 10 tablet": "It contains atorvastatin as its active ingredient, also known as statins. This medicine is used as an adjuvant to diet in patients with high cholesterol and abnormal levels of cholesterol. Atorlip 10 tablet decreases the synthesis of cholesterol in the body.30 Oct 2023", "admenta 10 tablet": "ADMENTA 10MG TABLET contains Memantine which belongs to the group of medicines called Anti-dementia drugs. It is used to treat moderate to severe Alzheimer's disease. Alzheimer's disease is a neurodegenerative disease that destroys memory and other important mental functions in an individual.29 Sept 2022", "amox 500mg capsule": "The amoxicillin molecular formula is C16H19N3O5S • 3H2O, and the molecular weight is 419.45. Amoxicillin capsules, tablets and powder for oral suspension are intended for oral administration. Amoxicillin Capsules provide amoxicillin trihydrate equivalent to 250 mg or 500 mg amoxicillin.", "asthalin respirator solution": "Product Summary", "add tears lubricant eye drop": "Add Tears Lubricant Eye Drop: View Uses, Side Effects, Price ... - 1mg", "almox 250 capsule": "It contains amoxicillin as an active ingredient. It stops the growth and multiplication of bacteria. Almox Capsule or other antibiotics should not be used when not sure if the infection is due to bacteria, unnecessary use of antibiotics can make it ineffective treatment.26 Oct 2023", "aztor asp 75 capsule": "Aztor ASP 75 Capsule 10's is composed of two medicines: Atorvastatin and Aspirin. Atorvastatin is a lipid-lowering medication and it blocks the enzyme required to make cholesterol in the body.", "alkacip syrup": "Product Summary", "arbitel-trio 50 tablet er": "Arbitel-Trio 50 Tablet 10's is a combination of three drugs, namely: Cilnidipine, Telmisartan, and Metoprolol. Cilnidipine acts on the calcium channels of the blood vessels and suppresses the contraction of blood vessels, thereby helps blood flow smoothly.", "acivir 200 dt tablet": "INTRODUCTION. ACIVIR DT 200MG TABLET contains Acyclovir, which belongs to the group of medicines called Antivirals. It is used to treat chickenpox, shingles, cold sores, genital herpes and other herpes simplex infections to prevent infections in people with a weakened immune system.20 Oct 2022", "augmentin es oral suspension": "Augmentin ES Oral Suspension contains two medicines, Amoxycillin and Clavulanic Acid, that work together to kill the bacteria that cause infections. Amoxycillin works by stopping the growth of bacteria. Clavulanic Acid reduces resistance and enhances the activity of Amoxycillin against bacteria.29 Nov 2023", "amrolstar cream": "AMROLSTAR CREAM contains Amorolfine which belongs to the group of medicines called Topical Anti-fungals. It is used in the treatment of fungal infections of the skin such as tinea pedis, tinea cruris, tinea corporis and tinea manuum. It is also used for treating cutaneous candidiasis and pityriasis versicolor.", "adalene nanogel gel": "Adalene Nano Gel contains two active ingredients: Adapalene and Clindamycin.Adapalene is a derivative of vitamin A that prevents the formation of blemishes and reduces swelling.Clindamycin is an antibiotic that works by controlling the growth of bacteria that cause acne and reducing inflammation.", "apigat 2.5 tablet": "Apigat 2.5mg TabletComposition. Apixaban (2.5mg)Form. Tablets.Chemical Class. Phenylpiperidines.Action Class. Oral Factor Xa Inhibitors.Therapeutic Class. BLOOD RELATED.Uses. Treatment and prevention of Blood clots.", "aeromont-b tablet": "Aeromont-B Tablet: View Uses, Side Effects, Price and Substitutes", "amlopres 5 tablet": "Amlopres 5 Tablet contains Amlodipine 5mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives.", "abevia-n tablet": "Abevia-N Tablet 10's is a combination of two drugs, namely: Acebrophylline (mucolytic and bronchodilator) and Acetylcysteine (mucolytic agent/sputum thinner). Acebrophylline belongs to the class of bronchodilators with additional mucolytic properties and works by relaxing muscles and widening the airways of the lungs.", "acamprol tablet": "ACAMPROL 333MG TABLET contains Acamprosate which belongs to the group of medicines called Psychiatry agents. It is used for patients with alcohol dependence by helping them abstain from drinking alcoholic drinks.17 Feb 2024", "ancool  oral suspension sugar free": "ANCOOL SUSPENSION SYRUP is a combination of Aluminium hydroxide, Magnesium hydroxide, Oxetacaine and Simethicone which belongs to the group of medicines called Antacids, Saline laxatives, Anesthetic antacids and Gastrointestinal agents respectively.29 Mar 2023", "atormac cv10 capsule": "Atormac CV 10 Capsule 10's is composed of two medicines, namely: Atorvastatin and Clopidogrel. Atorvastatin is a lipid-lowering medication which blocks the enzyme required to make cholesterol in the body.", "apdrops pd eye drop": "Apdrops PD Eye Drop is a combination of two medicines: Moxifloxacin and Prednisolone. Moxifloxacin is an antibiotic which prevents bacterial cells from dividing and repairing, thereby killing the bacteria.", "amnurite  10 tablet sr": "AMNURITE 10MG TABLET is a combination of Amitriptyline and Methylcobalamin, which belong to a group of medicines called Tricyclic antidepressants and Vitamins, respectively.27 Dec 2022", "atonide gel": "Atonide Gel: View Uses, Side Effects, Price and Substitutes | 1mg", "amlong-a tablet": "Amlong A (5/50 mg) Tablet is composed of Amlodipine and Atenolol. Amlodipine works by relaxing the heart muscles and blood vessels. Atenolol blocks certain substances (catecholamines) which increases blood pressure.23 Aug 2021", "acivir 500 infusion": "Acyclovir is a synthetic nucleoside analog active against herpes viruses. Acyclovir for Injection, USP is a sterile lyophilized powder for intravenous administration only. Each 500 mg vial contains 500 mg of acyclovir and 49 mg of sodium, and each 1,000 mg vial contains 1,000 mg acyclovir and 98 mg of sodium.", "af-k lotion": "AF-K Lotion is a combination of two antifungal medicines: Ketoconazole and Zinc pyrithione. It works by destroying the cell membrane of fungi that cause dandruff.3 days ago", "amoxyclav 375 tablet": "Amoxyclav 375 Tablet is a combination of two medicines: Amoxycillin and Clavulanic acid. It is used to treat bacterial infections like, tonsillitis, sinusitis, otitis media, respiratory tract infections, urinary tract infections, boils, abscesses, cellulitis, wound infection, bone infection, and oral cavity infections.19 Dec 2023", "abd 400mg tablet": "About ABD-400 Tablet 10's\n\n Additionally, ABD-400 Tablet 10's is also used to treat infections caused by roundworms, hookworms, threadworms, whipworms, pinworms, flukes, and other parasites. ABD-400 Tablet 10's contains 'Albendazole', which works by inhibiting tubulin polymerisation.", "amlong 2.5 tablet": "Amlong 2.5 Tablet 15's contains Amlodipine, a calcium channel blocker that acts by relaxing the blood vessels. This reduces the workload on the heart and makes the heart more efficient at pumping blood throughout the body. Thus, it helps to lower high blood pressure, reducing the chances of heart attack or stroke.", "alburel 20gm solution for infusion": "Alburel 20gm Solution for Infusion contains human albumin, a natural protein in blood. It works by replacing the blood or body fluids lost due to excessive bleeding, surgery, or kidney dialysis.29 Nov 2023", "anacin tablet": "Anacin Tablet is a combination of two medicines: Caffeine and Paracetamol. Caffeine narrows the blood vessels in the brain to reduce headache. Paracetamol is an analgesic (pain reliever) which works by blocking the release of certain chemical messengers that cause pain. Together, they relieve headache effectively.29 Nov 2023", "azithro 250mg tablet": "Azithromycin is a macrolide antibiotic belonging to the azalide group. The molecule is constructed by adding a nitrogen atom to the lactone ring of erythromycin A. The chemical name of azithromycin is 9-deoxy-9a-aza-9a-methyl-9a-homoerythromycin A. The molecular weight is 749.0.", "azimax 500 tablet": "What is Azimax 500 ?", "amlosafe-at tablet": "AMLOSAFE AT TABLET is a combination of Amlodipine and Atenolol which belongs to the group of medicine called Antihypertensive agents. It is used to treat hypertension (also known as high blood pressure) and angina pectoris (chest pain caused due to lack of oxygen supply to the heart).26 Feb 2024", "air 180 tablet": "Air 180 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "adilip 135 tablet dr": "Adilip 135 Tablet DR: View Uses, Side Effects, Price and Substitutes", "apdrops eye drop": "Product Summary", "amlosafe 5 tablet": "Amlosafe 5 Tablet contains Amlodipine 5mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives.", "apigat 5 tablet": "Apigat 5mg TabletBrand Name. Apigat.Composition. Apixaban (5mg)Chemical Class. Phenylpiperidines.Type Of Medicines. Allopathic.Action Class. Oral Factor Xa Inhibitors.Therapeutic Class. BLOOD RELATED.Uses. Treatment and prevention of Blood clots.", "amlogard 5mg tablet": "Amlogard 5mg Tablet contains Amlodipine 5mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives.", "amaryl mv 1mg tablet sr": "Amaryl MV 1mg Tablet SR is a combination of three medicines: Glimepiride, Metformin and Voglibose. This medicine is used in the treatment of type 2 diabetes mellitus (DM). It improves the blood glucose levels in adults when taken along with proper diet and regular exercise.29 Nov 2023", "alergin l tablet": "Alergin-L tablet contains levocetirizine, an anti-allergic medicine. This medicine acts by inhibiting the release of the chemical substance histamine, known to cause allergic conditions.26 Oct 2023", "aciloc injection": "Aciloc Injection 5 x 2 ml contains Ranitidine, a histamine-2 (H2) receptor blocker that helps reduce stomach acid by blocking the actions of the H2 receptor. The H2 receptor lies in the parietal cells of the stomach wall, and it is responsible for gastric acid secretion.", "alex p syrup": "Alex P Syrup is a combination of Chlorpheniramine, Menthol, Paracetamol, Phenylephrine, and Sodium Citrate. Chlorpheniramine works by blocking the action of histamine, a chemical substance in your body responsible for allergic symptoms.28 Oct 2021", "azr tablet": "AZR 50MG TABLET contains Azathioprine which belongs to the group of medicines called Immunosuppressants. Azathioprine is used to help the body to accept a kidney, liver, heart, lung, or pancreas transplant.30 Nov 2022", "angicam-beta tablet": "ANGICAM BETA TABLET contains two medicines namely amlodipine and atenolol. Atenolol blocks the effects of certain hormones (adrenaline) in the body that naturally increases heart rate. This slows down the heartbeat and makes the heart to pump blood with a lesser force. Amlodipine is a vasodilator.26 Feb 2024", "amicobal 10mg/1500mcg tablet": "Amicobal 10mg/1500mcg Tablet: View Uses, Side Effects ... - 1mg", "actibile 300 tablet": "ACTIBILE 300MG TABLET contains Ursodeoxycholic Acid that belongs to the group of medicines called Hepatoprotective agents. It is used to treat primary biliary cirrhosis (damage of bile ducts in liver leading to build up of bile).27 Oct 2022", "ambrolite levo syrup": "Ambrolite Levo Syrup is a combination of three medicines: Ambroxol, Levosalbutamol / Levalbuterol, Guaifenesin. It is used in the treatment of cough with mucus. Ambroxol is a mucolytic. It thins and loosens the mucus (phlegm) which makes it easier to cough out.29 Nov 2023", "amaryl m forte 2mg tablet pr": "Product Summary", "azicip 250 tablet": "It contains azithromycin as its active ingredient. This medicine should be taken as directed by the doctor and in doses and duration as prescribed. It can be taken with or without food. Always complete the entire course of the treatment, even if you start feeling better.26 Oct 2023", "algesia cr 200mg/20mg capsule": "Algesia CR 200mg/20mg Capsule is a combination of two medicines: Aceclofenac and Rabeprazole, which relieves pain. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID) which works by blocking the release of certain chemical messengers that cause pain and inflammation (redness and swelling).", "ascoril expectorant": "Product Summary", "atorva 80 tablet": "It is also used to reduce the risk of heart disease. Atorva 80 tablet contains atorvastatin as the active ingredient. Atorvastatin is a member of the statin class of medicines, which are used to control lipid (fat) levels in the body.15 Jul 2023", "acitrom 4 tablet": "Acitrom Tablet contains acenocoumarol which is structurally similar to vitamin K. Vitamin K is an essential factor required for blood clotting. Acenocoumarol inhibits the action of an enzyme which maintains the adequate levels of vitamin K required for blood clotting....26 May 2022", "alsita 100mg tablet": "Alsita 100mg Tablet: View Uses, Side Effects, Price and Substitutes", "amnurite  5 mg/1500 mcg tablet": "Amnurite 5 mg/1500 mcg Tablet: View Uses, Side Effects ... - 1mg", "airz capsule": "Airz Capsule 30's contains 'Glycopyrrolate', which works by relaxing the muscles around the airways in the lungs, thus making it easier to breathe. Thereby, Airz Capsule 30's helps in the treatment of wheezing, coughing, shortness of breath, and chest tightness.", "asomex 5 tablet": "Asomex-5 Tablet 15's contains 'S-amlodipine', a calcium channel blocker that acts by relaxing the blood vessels. This reduces the heart's workload and makes the heart more efficient at pumping blood throughout the body. Thus, it helps to lower high blood pressure, reducing the chances of heart attack or stroke.", "anaspas tablet": "Anaspas Tablet is a combination of two medicines: Camylofin and Diclofenac which relieve abdominal pain and cramps. Camylofin is an anticholinergic which relaxes the muscles in the stomach and gut (intestine). It stops sudden muscle contractions (spasms), thereby relieving cramps and pain.19 Feb 2024", "ascabiol emulsion": "Ascabiol Skin Emulsion contains cetrimide and gamma benzene hexachloride as active substances. Cetrimide is an antiseptic medicine that kills or stops the growth of microorganisms that cause scabies.22 Jun 2022", "addwize 10mg tablet": "Addwize 10mg Tablet is a CNS stimulant. It works by improving the activity of certain parts of the brain by increasing the levels of certain chemicals (norepinephrine and dopamine).6 Dec 2023", "amlong 10 tablet": "Amlong 10 Tablet contains Amlodipine 10mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives.", "abd plus tablet": "ABD PLUS TABLET contains a combination of Albendazole and Ivermectin, which belongs to a group of medicines called Anthelmintics. It is used to treat parasitic and worm infestations. Parasitic worm infections are intestinal worm infections that are caused by the ingestion of contaminated food and water.9 Mar 2023", "allercet-m tablet": "Allercet-M Tablet is a combination of two medicines: Levocetirizine and Montelukast, which relieves sneezing and runny nose due to allergies. Levocetirizine is an antiallergic which blocks a chemical messenger (histamine) responsible for runny nose, watery eyes and sneezing. Montelukast is a leukotriene antagonist.18 Dec 2023", "augpen -ds suspension": "Augpen HS BID 4.5 gm Syrup 30 ml contains Amoxicillin and Clavulanic acid. Amoxicillin works by preventing the formation of bacterial cell covering, which is necessary for the survival of the bacteria. Thereby, it kills the bacteria.", "althrocin liquid": "Althrocin Liquid: View Uses, Side Effects, Price and Substitutes | 1mg", "atocor 10 tablet": "Atocor 10 Tablet 15's contains 'Atorvastatin' which works by slowing the production of cholesterol in the body to decrease the amount of cholesterol that may build up on the arteries walls and block blood flow to the heart, brain, and other parts of the body.", "augpen 625 bid tablet": "Augpen 625 BID Tablet is a combination of two medicines: Amoxycillin and Clavulanic Acid. Amoxycillin is an antibiotic. It works by preventing the formation of the bacterial protective covering which is essential for the survival of bacteria.22 Mar 2024", "atchol-f tablet": "Atchol-F Tablet 10's is composed of two medicines, namely: Atorvastatin (HMG-CoA reductase inhibitor) and Fenofibrate (fibrates). Atorvastatin is a lipid-lowering medication that blocks the enzyme HMG-CoA reductase required to make cholesterol in the body.", "alensol-d tablet": "Alensol-D Tablet is a combination of two medicines: Alendronic Acid and Vitamin D3 which treat osteoporosis. Alendronic Acid is a bisphosphonate. It works by suppressing the activity of osteoclasts, cells that cause destruction of bone. This strengthens the bone and minimizes the risk of fractures.29 Nov 2023", "arbitel-trio 25 tablet er": "Arbitel-Trio 25 Tablet ER: View Uses, Side Effects, Price and ... - 1mg", "acivir eye ointment": "Acyclovir is a synthetic herpes simplex virus nucleoside analog DNA polymerase inhibitor. The drug substance is a white crystalline powder with the molecular formula of C8H11N5O3 and a molecular weight of 225.2. The maximum solubility in water at 25°C is 1.41 mg/mL. The pka's of acyclovir are 2.52 and 9.35.", "aceclo tablet": "Aceclo Tablet 10's contains 'Aceclofenac' which works by blocking the effect of a chemical messenger known as cyclo-oxygenase (COX) enzyme that makes other chemical prostaglandins. By blocking the effect of COX enzymes, lesser prostaglandins are produced.", "actrapid 100 iu/ml flexpen": "Actrapid InnoLet/Actrapid FlexPen 1 pre-filled pen contains 3 ml equivalent to 300 international units. 1 ml solution contains 100 international units insulin human* (equivalent to 3.5 mg). *Human insulin is produced in Saccharomyces cerevisiae by recombinant DNA technology.", "amitone 25mg tablet": "Amitone 25mg Tablet contains Amitriptyline, a tricyclic antidepressant. It has anticholinergic and sedative properties. It prevents the reuptake, and hence the inactivation of neurotransmitters called noradrenaline and serotonin, that are present at the nerve terminals in our brain.15 Mar 2024", "anafortan syrup": "Anafortan Syrup is a combination of two medicines: Camylofin and Paracetamol, which relieves abdominal pain. Camylofin is an anti-cholinergic which relaxes the muscles in the stomach and gut (intestine) and stops sudden muscle contractions (spasms).29 Nov 2023", "acera-d capsule sr": "Acera-D Capsule SR is a combination of two medicines: Domperidone and Rabeprazole. Domperidone is a prokinetic which works on the upper digestive tract to increase the movement of the stomach and intestines, allowing the food to move more easily through the stomach.22 Mar 2024", "aerodil sf expectorant": "Product Summary", "aculip h 12.5 mg/5 mg tablet": "Aculip H 12.5 mg/5 mg Tablet - 1mg", "aztolet  20 tablet": "Aztolet 20 Tablet 10's is composed of two medicines, namely: Atorvastatin and Clopidogrel. Atorvastatin is a lipid-lowering medication which blocks the enzyme required to make cholesterol in the body.", "amlopin 5 tablet": "Amlopin-5 Tablet 10's contains Amlodipine, a calcium channel blocker that acts by relaxing the blood vessels. This reduces the workload on the heart and makes the heart more efficient at pumping blood throughout the body. Thus, it helps to lower high blood pressure, reducing the chances of heart attack or stroke.", "arimidex 1mg tablet": "Arimidex contains a substance called anastrozole. This belongs to a group of medicines called 'aromatase inhibitors'. Arimidex is used to treat breast cancer in women who have gone through the menopause.", "alzil-m 5 tablet": "ALZIL M 5MG contains two medicines, namely donepezil and memantine. Donepezil acts by restoring the levels of acetylcholine in the brain by blocking the actions of an enzyme called acetylcholinesterase which usually breaks down acetylcholine.", "acuvert tablet": "Each uncoated orally disintegrating Acuvert 5 mg Tablet contains Prochlorperazine Maleate 5 mg. Prochlorperazine is an antipsychotic class of medication. It influences the activity of certain brain cells by decreasing the effect of dopamine, a natural chemical in the brain.", "alciflox 500mg tablet": "Alciflox 500mg Tablet: View Uses, Side Effects, Price and Substitutes", "azax 250 tablet": "Azax 250 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "aceclo spas tablet": "Aceclo Spas Tablet is a combination of two medicines: Drotaverine and Aceclofenac, which relieves abdominal pain and cramps. Drotaverine is an anti-spasmodic medicine which relieves contractions (spasms) associated with smooth muscles in the abdomen. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID).29 Nov 2023", "asthakind-ls drop": "Asthakind-LS Drop: View Uses, Side Effects, Price and Substitutes", "alphadol 0.25mcg capsule": "Alphadol 0.25mcg Capsule: View Uses, Side Effects, Price ... - 1mg", "alex cough lozenges sugar free": "Alex Cough Lozenges Sugar Free: View Uses, Side Effects ... - 1mg", "arip mt 10 tablet": "ARIP MT 10MG TABLET is an antipsychotic medicine. It contains aripiprazole which is an atypical antipsychotic used to treat mental illnesses. Xanax is a prescription medicine containing alprazolam. It is a tranquilizer used to reduce anxiety and to induce sleep.24 Nov 2022", "anabel liquid gel": "Anabel Liquid Gel: View Uses, Side Effects, Price and Substitutes", "aricep 5 tablet": "Aricep 5 MG Description\n\n epezil as the active ingredient. This medicine works by inhibiting the action of the chemical acetylcholinesterase, which is responsible for breaking down a molecule called acetylcholine in the brain. This raises the brain levels of acetylcholine which is associated with memory and recollection.26 Oct 2023", "aceclo sr tablet": "Aceclo SR Tablet 10's contains 'Aceclofenac' which works by blocking the effect of a chemical messenger known as cyclo-oxygenase (COX) enzyme that makes other chemical prostaglandins. By blocking the effect of COX enzymes, lesser prostaglandins are produced.", "azopt opthalmic suspension": "Azopt Opthalmic Suspension 5 ml contains Brinzolamide which works by inhibiting the action of carbonic anhydrase enzyme and decreasing bicarbonate production essential for the production of fluid in the eye (aqueous humour).", "amitop 10 tablet": "Amitop 10 Tablet contains Amitriptyline, a tricyclic antidepressant. It has anticholinergic and sedative properties. It prevents the reuptake, and hence the inactivation of neurotransmitters called noradrenaline and serotonin, that are present at the nerve terminals in our brain.29 Nov 2023", "ambulax m tablet": "Ambulax M Tablet is a combination of two medicines: Alprazolam and Propranolol. Alprazolam is a benzodiazepine. It works by increasing the action of GABA, a chemical messenger which suppresses the abnormal and excessive activity of the nerve cells in brain.6 Dec 2023", "alcipro 500mg tablet": "It contains ciprofloxacin as its main component. It should be taken as directed by the doctor and in doses and duration as prescribed. It is not to be discontinued abruptly without informing your doctor. The common side effects of the Alcipro 500 mg tablets are nausea, diarrhoea, headache and stomach pain.26 Oct 2023", "augpen lb 625 tablet": "Augpen LB 625 Tablet is a combination of three medicines: Amoxycillin, Clavulanic Acid and Lactobacillus. Amoxycillin is an antibiotic. It works by preventing the formation of the bacterial protective covering which is essential for the survival of bacteria.29 Nov 2023", "alkaliser syrup": "It contains disodium hydrogen citrate as the active ingredient. It acts as a urine alkalinzer. This syrup acts by increasing the pH of the urine, that is making it alkaline. Thus, enhancing the solubility of uric acid and further getting removed from the body via urine.17 Jul 2022", "aquaviron 40mg capsule": "Aquaviron 40mg Capsule is an injectable preparation which contains a synthetic form of testosterone (a male sex hormone). It is used in the treatment of male hypogonadism (a condition in which the body does not produce enough testosterone).", "angiwell 2.6mg tablet": "Angiwell 2.6 mg tablet is used to prevent chest pain caused by angina pectoris, spasms in the blood vessels of the heart mainly due to blockages in the heart vessels. It contains glyceryl trinitrate or nitroglycerin as its active component.10 Oct 2023", "anaflam th  4  tablet": "Anaflam TH 4 Tablet: View Uses, Side Effects, Price and Substitutes", "alzil 5 tablet": "Alzil 5 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "amlo 5mg tablet": "It contains amlodipine, an antihypertensive. It is also used for the treatment of angina pectoris (chest pain due to reduced blood flow to the heart). It works by relaxing the blood vessels and improving the blood flow.4 Oct 2023", "asthalin plus expectorant": "Asthalin Plus Expectorant is a combination of three medicines: Ambroxol, Levosalbutamol / Levalbuterol, Guaifenesin. It is used in the treatment of cough with mucus. Ambroxol is a mucolytic. It thins and loosens the mucus (phlegm) which makes it easier to cough out.", "amitone plus tablet": "A: AMITONE PLUS TABLET is a combination of Amitriptyline and Chlordiazepoxide which belongs to the group of medicines called Tricyclic antidepressants and Benzodiazepines respectively. It is used to treat moderate to severe depression and anxiety in adults.18 Jan 2023", "akt 2 tablet": "Akt 2 Tablet is a combination of two medicines: Rifampicin and Isoniazid. It is used in the treatment of tuberculosis. Rifampicin works by inactivating a bacterial enzyme (RNA-polymerase) which is required by tuberculosis bacteria to make essential proteins and reproduce.16 Feb 2024", "alex plus paediatric oral drops": "Alex Plus Paediatric Oral Drops: View Uses, Side Effects ... - 1mg", "antacid tablet": "Most commercially available antacids are combinations of aluminum and magnesium hydroxide. Some effervescent antacids contain sodium bicarbonate, that old household remedy for tummy aches known as “baking soda.”", "apresol tablet": "Apresol tablet contains dihydralazine as the active substance that works by relaxing the blood vessels. Apresol tablet should only be used in adults above 18 years of age.1 Dec 2023", "atchol 40 tablet": "Atchol 40 tablet contains atorvastatin as the active ingredient. atorvastatin is a member of the statin class of medicines, which are used to control lipid (fat) levels in the body. This medicine works by preventing the action of a chemical necessary for cholesterol formation.26 Oct 2023", "amlong-h tablet": "Product Summary", "airz-ff capsule": "Airz-FF Capsule is a combination of three medicines : Glycopyrrolate, Formoterol, and Fluticasone Propionate, that treats Chronic obstructive pulmonary disease (COPD). Glycopyrrolate is an anticholinergic medication.", "arflur 3d tablet": "Arflur 3D Tablet is a combination of three medicines: Aceclofenac, Paracetamol and Serratiopeptidase. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID), and Paracetamol is an antipyretic (fever reducer). They work by blocking the release of certain chemical messengers in the brain that cause pain and fever.20 Feb 2024", "azmarda 200mg tablet": "Azmarda 200mg Tablet is a combination of two medicines: Sacubitril and Valsartan which belong to a class of angiotensin receptor neprilysin inhibitor (ARNI). This combination treats heart failure by relaxing the blood vessels and making it easier for your heart to pump blood throughout your body.", "amixide 10mg tablet": "Amixide Tablet 10's is a combination of two drugs: Amitriptyline (tricyclic anti-depressant) and Chlordiazepoxide (benzodiazepine anxiolytic). Amitriptyline works by affecting certain chemical messengers in the brain that communicate between brain cells, thereby regulating mood and treating depression.", "avomine 25mg tablet md": "Avomine 25 MG Description\n\n It is also used for the treatment of nausea and vomiting caused due to motion sickness. Avomine contains promethazine as its active ingredient. Promethazine in tab Avomine works by opposing the action of histamine (natural substances produced in the body during allergic conditions).8 Feb 2024", "arpizol 2mg tablet": "Arpizol 2mg Tablet: View Uses, Side Effects, Price and Substitutes", "ascodex cough syrup": "Ascodex Ls syrup is a combination of ambroxol, guaifenesin and levosalbutamol. It helps in relieving symptoms such as spasm, blockage, swelling and contraction in airways and lungs during asthmatic attacks and chronic bronchitis. This medicine needs to be taken as directed by the doctor.26 Apr 2022", "aerocort forte rotacap": "Aerocort Forte Rotacap is a combination of two medicines: Levosalbutamol and Beclometasone. Levosalbutamol is a bronchodilator which works by relaxing the muscles in the airways and widens the airways. Beclometasone is a steroid medicine.19 Feb 2024", "af 200 tablet": "AF-200 Tablet 1's contains 'Fluconazole' that kills or prevents fungi or yeast by inhibiting an enzyme in fungi responsible for its normal fat metabolism, which interferes with the formation of the fungal cell membrane. As a result, fungal or yeast cells get killed or their growth is minimized.", "aquasurge  eye drop": "Aquasurge Eye Drop: View Uses, Side Effects, Price and Substitutes", "atorva asp 75 capsule": "Atorva Asp 75 Capsule: View Uses, Side Effects, Price and Substitutes", "azivent 500 tablet": "Azivent 500 Tablet: View Uses, Side Effects, Price and Substitutes", "azithral eye ointment": "Azithral Eye Ointement 5 gm contains azithromycin which works by killing the conjunctivitis-causing bacteria. Thus Azithral Eye Ointement 5 gm treats bacterial eye infections.", "adtrol xt tablet": "Adtrol XT Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "aqualube eye drop": "Aqualube Eye Drop: View Uses, Side Effects, Price and Substitutes", "antisnake venom injection": "Snake Venom Antiserum₹ 510 / Piece WhatsApp.Clindamycin Phosphate Injection Ip 600mg/4ml₹ 36 / Piece WhatsApp.Doxofylline Injection₹ 15 / Pack WhatsApp.Hydrocortisone Sodium Succinate Injection₹ 16 / Vial WhatsApp.", "acrotac 25mg capsule": "ACROTAC 25MG contains acitretin which belongs to a group of medicines called 'retinoids. It is used to treat severe skin condition in which the skin has become thick and scaly. These skin problems include the psoriasis, ichthyosis and keratosis follicularis (Darier's disease).", "azathioprine 50mg tablet": "Azathioprine 50mg Tablet: View Uses, Side Effects, Price and ... - 1mg", "amrolstar nail lacquer": "About Amrolstar Nail Lacquer\n\n AMOROLFINE contains 'Amorolfine' that works by stopping producing a chemical called 'ergosterol' in fungi that causes nail infection. Without ergosterol, the fungus cannot survive. As a result, infection-causing fungi die.", "allercet-m syrup": "Allercet-M Syrup contains Levocetirizine and Montelukast. Together these two relieve sneezing and runny nose caused due to allergies. Levocetirizine is an antiallergic that blocks a chemical messenger (histamine) responsible for runny nose, watery eyes, and sneezing. Montelukast is a leukotriene antagonist.29 Nov 2023", "atchol 10 tablet": "Atchol 10 Tablet 10's contains 'Atorvastatin' which works by slowing the production of cholesterol in the body to decrease the amount of cholesterol that may build up on the arteries walls and block blood flow to the heart, brain, and other parts of the body.", "alphagan z ophthalmic solution": "Alphagan Z 0.1 % Description\n\n It contains brimonidine as the active ingredient. Alphagan Z ophthalmic solution works by decreasing the production of aqueous humour (watery fluid similar to plasma) in the eye which helps to reduce the pressure inside the eyes.27 Sept 2022", "acutret 10 capsule": "Acutret 10 Capsule 10's contains 'isotretinoin', a form of vitamin A that works by reducing sebum (skin's natural oil) production on the skin's surface by decreasing the activity and size of sebaceous glands. Thereby unblocks pores and kills acne-causing bacteria.", "acnedap gel": "ACNEDAP GEL contains Dapsone which belongs to the group of medicines called Sulfone antibiotics. It is used in the treatment of acne vulgaris (a skin condition that occurs when the hair follicles are blocked with dead skin cells, bacteria and sebum).6 Dec 2022", "amoxycillin 125mg oral suspension": "Powder for Oral Suspension: Each 5 mL of reconstituted suspension contains 125 mg, 200 mg, 250 mg or 400 mg amoxicillin as the trihydrate. Each 5 mL of the 125-mg reconstituted suspension contains 0.11 mEq (2.51 mg) of sodium. Each 5 mL of the 200-mg reconstituted suspension contains 0.15 mEq (3.39 mg) of sodium.", "advanced lcf kid expectorant": "Advanced LCF Kid Expectorant: View Uses, Side Effects ... - 1mg", "amitryn 10 tablet": "Amitryn 10 Tablet contains Amitriptyline, a tricyclic antidepressant. It has anticholinergic and sedative properties. It prevents the reuptake, and hence the inactivation of neurotransmitters called noradrenaline and serotonin, that are present at the nerve terminals in our brain.29 Nov 2023", "amtas-at tablet": "Amtas-AT Tablet is a combination medicine that contains two active ingredients, Amlodipine and Atenolol. Both of the medicines in this combination work to lower blood pressure but in different ways.19 Feb 2024", "accentrix solution for injection": "Ranibizumab. One mL contains 10 mg ranibizumab. Each vial contains 2.3 mg of ranibizumab in 0.23 mL solution. Ranibizumab is a humanized monoclonal antibody fragment produced in Escherichia coli cells by recombinant DNA technology.", "arpizol 10 tablet": "Arpizol 10 Tablet 10's contains Aripiprazole which stabilizes and blocks the dopamine and serotonin receptors in the brain, preventing its overactivity, thereby controlling the positive symptoms like hallucinations, misbelief, and unfriendly characteristics of schizophrenia.", "aldactone 100 tablet": "PRINCIPAL DISPLAY PANEL - 100 mg Tablet Bottle Label", "aztogold 20 capsule": "Aztogold 20 Capsule is a combination of three medicines: Aspirin / Acetylsalicylic acid, Atorvastatin and Clopidogrel. Aspirin and Clopidogrel are antiplatelet medicines. They work by preventing the platelets from sticking together and decrease the formation of harmful blood clots.22 Mar 2024", "addna tablet": "Addna Tablet contains sodium and chloride ions, which are essential electrolytes for various bodily functions. Sodium regulates water distribution and fluid balance, while chloride is important for maintaining acid-base balance. This tablet helps replenish these electrolytes when they are deficient.6 Jan 2024", "amtas-m 50 tablet pr": "Amtas-M 50 Tablet 15's is a fixed-dose combination composed of two medicines, namely: Amlodipine and Metoprolol. Amlodipine is a calcium channel blocker while Metoprolol belongs to a group of medicines called beta-blockers.", "akilos-p tablet": "Akilos-P Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling).31 Jan 2024", "avas cv 10 capsule": "Avas CV 10 Capsule 10's is composed of two medicines, namely: Atorvastatin and Clopidogrel. Atorvastatin is a lipid-lowering medication which blocks the enzyme required to make cholesterol in the body.", "actilyse 50mg injection": "Actilyse 50mg injection contains an active component as Alteplase. It is also known as recombinant tissue plasminogen activator (rt-PA), used to treat certain medical conditions involving blood clots. It is a thrombolytic agent, meaning it helps to break down blood clots.6 Jan 2024", "acceclowoc-sp tablet": "Acceclowoc SP tablet contains aceclofenac, paracetamol, and serratiopeptidase as active substances. Aceclofenac and paracetamol are non-steroidal anti-inflammatory medicines (NSAIDs) that block the action of a chemical called cyclooxygenase.26 Oct 2023", "amodep at tablet": "Amodep AT tablet contains a combination of amlodipine and atenolol as active substances. It lowers the blood pressure, heart rate and contractility of heart muscles. Patients with kidney and liver function problems and the elderly should be very cautious while taking this medicine.1 Oct 2023", "amlopres at 25 tablet": "Amlopres AT 25 Tablet: View Uses, Side Effects, Price and Substitutes", "acular ls ophthalmic solution": "ACULAR LS™ (ketorolac tromethamine ophthalmic solution) 0.4% is a member of the pyrrolo-pyrrole group of nonsteroidal anti-inflammatory drugs (NSAIDs) for ophthalmic use. Contains: Active: ketorolac tromethamine 0.4%. Preservative: benzalkonium chloride 0.006%.", "anxipan capsule": "Anxipan Capsule is a combination of two medicines: Amitriptyline and Pantoprazole which treat gastroesophageal reflux disease (GERD) associated with anxiety. Amitriptyline is a tricyclic antidepressant which increases the levels of chemical messengers in the brain that help in regulating the mood and treat depression.17 Jan 2024", "advent 91.4mg drops tangy orange": "Advent 91.4mg Drops Tangy Orange - IndiMedo Pharmacy", "azee xl 200mg dry syrup peppermint": "Azee XL 200mg Dry Syrup Peppermint - 1mg", "abevia 100 capsule": "Abevia 100 Capsule comprises of theophylline-7 acetate and ambroxol which makes it effective in making the mucus more fluid and clearing the airways easily, thereby making breathing easier. This effect of Abevia 100 Capsule works as an added advantage over theophylline.29 Nov 2023", "alex oral drops orange": "Alex Oral Drops Orange: View Uses, Side Effects, Price and ... - 1mg", "amoxyclav ds syrup": "Amoxyclav DS Syrup comprises two active ingredients, amoxycillin and clavulanic acid. While clavulanic acid stops the enzyme from rendering amoxycillin ineffective, amoxycillin works towards killing the tuberculosis-causing bacteria.29 Nov 2023", "alcoliv tablet": "Alcoliv Tablet contains the active ingredient Metadoxine, which is a medication used to support liver function and treat alcohol-related liver disease. Metadoxine acts by improving the metabolism of alcohol and reducing its toxic effects on the liver.", "anosum cream": "Anosum Cream is a combination of three medicines: Lidocaine, Metronidazole and sucralfate. Lidocaine is a local anesthetic. It works by blocking pain signals from the nerves to the brain which decreases pain sensation.", "amlovas-m 5/50 tablet pr": "Amlovas M 5/50 Tablet 10's is a fixed-dose combination composed of two medicines, namely: Amlodipine and Metoprolol. Amlodipine is a calcium channel blocker while Metoprolol belongs to a group of medicines called beta-blockers.", "alkamax mb alkamax mb6 oral solution": "Alkamax MB Alkamax MB6 Oral Solution is a combination of three medicines: Potassium Citrate, Magnesium Citrate and Vitamin B6 (Pyridoxine) which prevent kidney stones.29 Nov 2023", "amlosafe tm 40 tablet": "Amlosafe TM 40 Tablet is a combination of two medicines: Telmisartan and Amlodipine. Telmisartan is an angiotensin receptor blocker (ARB) and Amlodipine is a calcium channel blocker (CCB). They work by relaxing the blood vessels and making the heart more efficient at pumping blood throughout the body.22 Mar 2024", "apetamin syrup": "According to manufacturing labels, 1 teaspoon (5 ml) of Apetamin syrup contains:Cyproheptadine hydrochloride: 2 mg.L-lysine hydrochloride: 150 mg.Pyridoxine (vitamin B6) hydrochloride: 1 mg.Thiamine (vitamin B1) hydrochloride: 2 mg.Nicotinamide (vitamin B3): 15 mg.", "aceflam p 100mg/325mg tablet": "Aceflam P 100mg/325mg Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling).29 Nov 2023", "ascovent -sr tablet": "Fact BoxChemical Class. Methylxanthine Derivative.Habit Forming. No.Therapeutic Class. RESPIRATORY.Action Class. Theophylline & its derivatives.", "acotrust  tablet": "ACOTRUST 100MG TABLET contains Acotiamide, which belongs to the group of medicines called Gastro-intestinal agents. It is used in the treatment of functional dyspepsia. Functional dyspepsia is a chronic functional disorder of the upper digestive system that affects sensation and movement.1 Dec 2022", "acupat ophthalmic solution": "ACUPAT OPHTHALMIC SOLUTION contains two medicines namely ketorolac and olopatadine. Ketorolac is a pain-relieving medication. It blocks the release of certain chemicals in the body (such as prostaglandins) that causes inflammation, redness and swelling.17 Jan 2023", "arcolane 2% scalp solution": "ARCOLANE SCALP SOLUTION contains Ketoconazole which belongs to the group of medicines called Antifungals. It is used to treat fungal infections on scalp and body such as dandruff, seborrheic dermatitis (a dry or oily scaling of the scalp and other parts of the body) and tinea versicolor.27 Oct 2022", "atropine 1% eye drop": "Description for Atropine\n\n Chemical Name: Benzeneacetic acid, α-(hydroxymethyl)-, 8-methyl-8-azabicyclo[3.2. 1.] oct-3-yl ester, endo –(±)-, sulfate (2:1) (salt), monohydrate.", "amyclox-lb capsule": "Amyclox-LB Capsule is a combination of three medicines: Amoxycillin, Cloxacillin, and Lactobacillus. Amoxycillin and Cloxacillin are antibiotics which work by preventing the formation of the bacterial protective covering that is essential for the survival of bacteria in the human body.29 Nov 2023", "alamin injection": "About Alamin Injection\n\n Alamin is a naturally occurring coenzyme form of Vitamin B12, which circulates through the bloodstream. In addition to the Vitamin B12 structure, it has an additional methyl containing metal-alkyl group. It helps the body to produce red blood cells and can be used as a dietary supplement.", "aquim pf eye drop": "Aquim Pf 0.1 %W/V Description\n\n It contains hyaluronic acid (sodium hyaluronate), a soothing agent. This eyedrop makes wearing of hard and soft contact lenses more comfortable. It should be used as directed by the doctor.28 Dec 2023", "arbitel-am tablet": "Arbitel-AM Tablet is a combination of two medicines: Telmisartan and Amlodipine. Telmisartan is an angiotensin receptor blocker (ARB) and Amlodipine is a calcium channel blocker (CCB). They work by relaxing the blood vessels and making the heart more efficient at pumping blood throughout the body.30 Nov 2023", "aprecap 125/80 capsule": "Aprecap 125/80 Capsule: View Uses, Side Effects, Price and ... - 1mg", "ab phylline syrup": "AB Phylline Syrup comprises of theophylline-7 acetate and ambroxol which makes it effective in making the mucus more fluid and clearing the airways easily, thereby making breathing easier.29 Nov 2023", "azeflo ft nasal spray": "Azeflo FT Nasal Spray: View Uses, Side Effects, Price and Substitutes", "atorva f tablet": "Atorva F Tablet contains Atorvastatin and Fenofibrate. A very rare (1 in 10000 patient) side effect of this medicine is liver damage. Use of this medicine should be avoided in patients with underlying liver disease. Contact your doctor immediately if you notice any early signs and symptoms of liver damage.29 Nov 2023", "amicline plus tablet": "Amicline Plus Tablet is a combination of two medicines: Ornidazole and Diloxanide. Ornidazole is an antibiotic. It kills the bacteria and other microorganisms that cause infections by damaging the DNA. Diloxanide is an amoebicide.29 Nov 2023", "acimol mr 100mg/325mg/250mg tablet": "Acimol MR 100mg/325mg/250mg Tablet is a combination of three medicines: Aceclofenac, Paracetamol and Chlorzoxazone. This medicine helps in relieving muscle pain by relaxing the affected muscles.19 Jan 2024", "asthakind tablet": "It is a combination medicine containing - bromhexine, guaifenesin and terbutaline. Bromhexine is a mucolytic agent, guaifenesin is an expectorant, and terbutaline is a bronchodilator. Asthakind expectorant Sugar Free works by thinning, liquefying, and loosening the mucus and makes expulsion easy.9 May 2022", "aprezo 10 tablet": "Aprezo 10 Tablet 4's contains Apremilast, a phosphodiesterase 4 (PDE4) inhibitor.", "air 120 tablet": "Air 120 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "amoxycillin  250mg capsule": "The amoxicillin molecular formula is C16H19N3O5S • 3H2O, and the molecular weight is 419.45. Amoxicillin capsules, tablets and powder for oral suspension are intended for oral administration. Amoxicillin Capsules provide amoxicillin trihydrate equivalent to 250 mg or 500 mg amoxicillin.", "acenac sp 100mg/325mg/15mg tablet": "Acenac SP 100mg/325mg/15mg Tablet is a combination of three medicines: Aceclofenac, Paracetamol and Serratiopeptidase. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID), and Paracetamol is an antipyretic (fever reducer).29 Nov 2023", "aginal-at tablet": "Aginal AT tablet contains a combination of amlodipine and atenolol as active substances. It works by lowering the blood pressure, heart rate and contractility of heart muscles. Patients with kidney and liver function problems and the elderly should be very cautious while taking this medicine.26 Oct 2023", "allrite dc tablet er": "Allrite DC Tablet ER is a combination of two medicines: Levocetirizine and Phenylephrine, which relieves sneezing and runny nose caused due to allergies.29 Nov 2023", "asthalin 2 tablet": "Asthalin 2 MG Description\n\n associated with asthma and chronic obstructive pulmonary disease (COPD). It contains Salbutamol as its active ingredient. This medicine acts as a bronchodilator and works by relaxing the muscles of the airway, thus widening the passage and easing breathing.7 May 2022", "arip mt 2 tablet": "Arip Mt 2mg Tablet 15's contains Aripiprazole, an antipsychotic that works by inhibiting the dopamine receptors in the brain and prevents its overactivity. Thereby, helps in controlling the positive symptoms (such as hallucinations, misbelief and unfriendliness) of schizophrenia.", "alcet 5mg tablet": "Alcet 5 MG Description\n\n It contains levocetirizine as its active medicine. Allergic symptoms appear due to the production of a chemical in the body, namely histamine. Alcet Tablet works by blocking the actions of histamine. Do not use it if you are allergic to levocetirizine.26 Oct 2023", "aplazar tablet": "Aplazar tablet is a nutrient supplement with an active ingredient called Alpha Ketoanalogue. It belongs to the class of medicine called amino acids. It is given along with a protein-restricted diet to delay the progression of chronic kidney disease (CKD).22 Feb 2024", "amicon 10 tablet": "Amicon 10 Tablet contains Amitriptyline, a tricyclic antidepressant. It has anticholinergic and sedative properties. It prevents the reuptake, and hence the inactivation of neurotransmitters called noradrenaline and serotonin, that are present at the nerve terminals in our brain.29 Nov 2023", "amaryl m forte 1mg tablet pr": "Amaryl M Forte 1mg Tablet PR is a combination of two antidiabetic medicines: Glimepiride and Metformin. Glimepiride is a sulfonylurea which works by increasing the amount of insulin released by the pancreas in order to lower the blood glucose.29 Nov 2023", "amicline tablet": "Amicline 500 tablet contains diloxanide furoate as an active ingredient. This medicine works by preventing the microorganism called entamoeba histolytica parasite from growing and spreading in the body.6 Jul 2023", "acivir iv injection": "About Acivir IV Injection 10 ml\n\n Acivir IV Injection 10 ml is composed of Aciclovir, which works by killing and stopping the growth of herpes simplex virus type 1 (HSV-1), 2 (HSV-2), and varicella-zoster virus (VZV). Acivir IV Injection 10 ml will be administered by a healthcare professional; do not self-administer.", "atm 200 oral suspension": "Each 1 ml reconstituted suspension contains 41.92 mg of azithromycin dihydrate equivalent to 40 mg of azithromycin. Each 5 ml reconstituted suspension contains 3.71 g of sucrose, 0.030 g of aspartame (E 951), up to 410 nanograms of benzyl alcohol and up to 85 nanograms of sulphites.", "apidra solostar 100iu/ml injection": "The active ingredient in Apidra Solostar 100IU/ml Injection 3 ml is insulin glulisine. Apidra Solostar 100IU/ml Injection 3 ml is a recombinant human insulin analogue that is equipotent to regular human insulin.", "ab2 kit": "AB2 Kit", "atarax 25mg injection": "Product Summary", "afoglip m  500 tablet er": "Afoglip M 500 Tablet ER: View Uses, Side Effects, Price and ... - 1mg", "amlozaar tablet": "Amlozaar Tablet is a combination of two medicines: Losartan and Amlodipine which lower blood pressure effectively. Losartan is an angiotensin receptor blocker (ARB) and Amlodipine is a calcium channel blocker (CCB).", "abel 40 tablet": "Abel-40 Tablet 10's contains 'Azilsartan medoxomil' which belongs to the class of 'antihypertensives'. It is primarily used to reduce high blood pressure. It is an angiotensin-II receptor blocker (ARB) that blocks the hormone angiotensin.", "acolate plus tablet": "Acolate-Plus Tablet 10's is primarily used to treat the common cold and allergy symptoms such as runny nose, blocked nose, sneezing, congestion, pain & fever. It is composed of three medicines, namely, Cetirizine (antihistamine), Phenylephrine (decongestant), and Paracetamol (mild analgesic and antipyretic).", "ampilox ds tablet": "Ampilox DS Tablet is a combination of two antibiotics: Ampicillin and Dicloxacillin. These antibiotics work by preventing the formation of the bacterial protective covering which is essential for the survival of bacteria. Together, they treat your infection effectively.", "asthalin rotacaps": "Product Summary", "asthalin dx syrup": "Asthalin DX Syrup is a combination of three medicines: Phenylephrine, Chlorpheniramine Maleate, and Dextromethorphan Hydrobromide. Phenylephrine is a decongestant which narrows the small blood vessels providing relief from congestion or stuffiness in the nose.23 Jan 2024", "atorlip 20 tablet": "Atorlip 20 Tablet 15's contains 'Atorvastatin' which works by slowing the production of cholesterol in the body to decrease the amount of cholesterol that may build up on the arteries walls and block blood flow to the heart, brain, and other parts of the body.", "altacef 500 tablet": "Altacef tablet contains cefuroxime, a third-generation cephalosporin; the medication is a broad-spectrum antibiotic that acts on bacterial cell wall synthesis. Cefuroxime mainly attaches to penicillin-binding proteins and inhibits the cell wall synthesis of bacteria....26 Oct 2023", "amlokind 2.5 tablet": "Amlokind 2.5 Tablet contains Amlodipine 2.5mg used to treat high blood pressure or hypertension. It also helps in the prevention of angina (chest pain due to heart problems) Chemical Class: Dihydropyridine Carboxylic acids derivatives.", "ambistryn-s 0.75gm injection": "Streptomycin Injection(Ambistryn-S 0.75gm Injection)Brand Name. Ambistryn-S 0.75gm Injection.Manufacturer. Abbott.Packaging Size. 1 Injection in 1 vial.Composition. Streptomycin 0.75gm.Tuberculosis (TB)", "ambulax-et tablet": "Ambulax-ET Tablet is a combination of two medicines: Etizolam and Propranolol. Etizolam is a benzodiazepine. It works by increasing the action of GABA, a chemical messenger which suppresses the abnormal and excessive activity of the nerve cells in brain.6 Dec 2023", "acceclowoc-p tablet": "Product Summary", "alprax forte 0.5 mg/50 mg tablet": "Alprax Forte 0.5 mg/50 mg Tablet - 1mg", "alsita-m 100 tablet er": "Alsita-M 100 Tablet ER: View Uses, Side Effects, Price and Substitutes", "axogurd nt tablet sr": "Axogurd NT Tablet SR is a combination of two medicines: Pregabalin and Nortriptyline. Pregabalin is an alpha 2 delta ligand which decreases the pain by modulating calcium channel activity of the nerve cells.29 Nov 2023", "aclind bp 2.5% gel": "Aclind BP 2.5% Gel: View Uses, Side Effects, Price and Substitutes", "anxiset 0.5 tablet": "Anxiset 0.5 MG Description\n\n wo active ingredients: flupenthixol 0.5 mg and melitracen 10 mg. Flupenthixol alters the action of chemical messengers in the brain. It alters the mood. Melitracen regulates the mood and helps tackle depression.25 Jan 2022", "atonide-h cream": "ATONIDE H CREAM contains Hydrocortisone acetate which belongs to the group of medicines called Corticosteroids. ATONIDE H CREAM is used to treat all types of eczema (type of skin inflammation), dermatitis (itching) and insect bite reactions in affected individuals.", "aldonil tablet": "Aldonil Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "anticold  tablet": "Anti Cold Tablets Description\n\n It contains the combination of three active ingredients- paracetamol, cetirizine and phenylephrine.6 May 2022", "alcros 100 capsule": "Alcros 100 Capsule: View Uses, Side Effects, Price and Substitutes", "azibact 200 readymix oral suspension": "AZIBACT 200MG READYMIX SUSPENSION contains Azithromycin which belongs to the group of medicines called Macrolides.26 Feb 2024", "atchol 20 tablet": "Atchol 20 tablet contains atorvastatin as the active ingredient. atorvastatin is a member of the statin class of medicines, which are used to control lipid (fat) levels in the body. This medicine works by preventing the action of a chemical necessary for cholesterol formation.26 Oct 2023", "azibest 500mg tablet": "Azibest 500mg Tablet: View Uses, Side Effects, Price and Substitutes", "amoxy 500mg capsule": "Amoxy 500 MG Description\n\n It contains amoxicillin as an active ingredient. It stops the growth and multiplication of bacteria. Amoxy Capsule or other antibiotics should not be used when not sure if the infection is due to bacteria, unnecessary use of antibiotics can make it ineffective treatment.25 Aug 2021", "a-ret 0.05% gel": "Skim through", "adenosine 3mg injection": "Expand AllAdenosine 3mg/ml Solution for Injection.Each 1ml of solution contains 3mg of adenosine. Each vial contains 6mg of adenosine per 2ml of solution (3mg/ml). It also contains 3.54mg (0.15mmol) of sodium per 1ml of solution. ... Solution for injection (injection). Clear, colourless solution.", "ascoril plus tablet": "Ascoril Plus Strip Of 15 Tablets Description\n\n Ascoril Tablet contains guaifenesin (guaiphenesin), terbutaline and bromhexine. Guaifenesin is an expectorant group of medicine, terbutaline is a bronchodilator, and bromhexine is a mucolytic group of medicine.4 Jun 2021", "azulix 2 mf forte tablet pr": "Azulix 2 MF Forte Tablet PR is a combination of two medicines: Glimepiride and Metformin. This medicine is used in the treatment of type 2 diabetes mellitus (DM). It improves blood glucose levels in adults when taken along with proper diet and regular exercise.22 Mar 2024", "amlokind-h tablet": "Amlokind-H Tablet: View Uses, Side Effects, Price and Substitutes", "aziderm 10% gel": "It contains 'Azelaic acid', a dicarboxylic acid with antibacterial, keratolytic (removes warts, calluses and other lesions), comedolytic (inhibiting the formation of blemishes), and anti-oxidant activity. Aziderm 10% Gel 15 gm is bactericidal and inhibits the synthesis of microbial cellular proteins.", "amlopin-m tablet pr": "Amlopin M (5/50 mg) Tablet is a combination medicine that consists of amlodipine and metoprolol. It is used for the treatment of high blood pressure, abnormal heart rhythms and heart failure. It slows down the activity of your heart and relaxes your blood vessels, allowing your heart to pump blood more easily.16 Sept 2021", "ascodex junior syrup": "Ascodex Junior Syrup is a combination of three medicines: Phenylephrine, Chlorpheniramine Maleate, and Dextromethorphan Hydrobromide. Phenylephrine is a decongestant which narrows the small blood vessels providing relief from congestion or stuffiness in the nose.", "alevo 500 tablet": "Alevo 500 MG Description\n\n It contains levofloxacin as its main ingredient that belongs to the group of antibiotics called fluoroquinolone. Take this medicine as prescribed by your doctor. Some common side effects of this tablet include a headache, dizziness, nausea and also diarrhoea.26 Oct 2023", "avanair 200 tablet": "Avanair 200 Tablet: View Uses, Side Effects, Price and Substitutes", "atorlip 40 tablet": "Atorlip 40 MG Description\n\n It contains atorvastatin as its active ingredient, also known as statins. This medicine is used as an adjuvant to diet in patients with high cholesterol and abnormal levels of cholesterol. This medicine decreases the synthesis of cholesterol in the body.31 Oct 2023", "anafortan-mf 50mg/250mg tablet": "Anafortan-MF 50mg/250mg Tablet is a combination of two medicines: Camylofin and Mefenamic Acid which relieve abdominal pain and cramps. Camylofin is an anti-cholinergic which relaxes the muscles in the stomach and gut (intestine) and stops sudden muscle contractions (spasms).29 Nov 2023", "amitriptyline hcl 25mg tablet": "Amitriptyline hydrochloride is an organic tricyclic compound. Amitriptyline Hydrochloride is the hydrochloride salt of the tricyclic dibenzocycloheptadiene amitriptyline with antidepressant and antinociceptive activities.", "aqsusten  25 solution for injection": "Aqsusten 25 Solution for Injection contains progesterone, a female hormone that is important in the regulation of ovulation and menstruation. It is used to cause menstrual periods in women who have not reached menopause but are not having periods due to a lack of natural progesterone in the body.2 Jan 2024", "amicet 5 mg/60 mg tablet": "Amicet 5 mg/60 mg Tablet is a cough reliever that combines two medicines: levocetirizine and ambroxol. Antiallergic levocetirizine is used to treat runny noses, watery eyes, and sneezing. Ambroxol is a mucolytic, meaning it thins and loosens mucus (phlegm) to make coughing easier.9 Feb 2023", "amrox junior syrup": "Amrox Junior Syrup is a combination of ambroxol, guaiphenesin and terbutaline, as its active ingredients. It is used to treat cough associated with infections in the airways, asthma, shortness of breath and lung infections.17 Jul 2022", "atm 250 tablet": "ATM 250 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "anawin heavy 5mg injection": "Anawin Heavy 5mg Injection contains the active component Bupivacaine hydrochloride. It is a local anesthetic medication used for various medical procedures to numb a specific body area.19 Feb 2024", "adaple-c gel": "Adaple-C Gel is a combination of two medicines: Adapalene and Clindamycin, which treats pimples (acne). Adapalene is a form of vitamin A which prevents accumulation of the sebum (skin's natural oil), unblocks the pores and allows natural exfoliation of the outer layers of skin.", "aravon injection": "ARAVON INJECTION contains Edaravone which belongs to group of medicines called Antioxidants. ARAVON INJECTION is used to treat amyotrophic lateral sclerosis (nervous system disease that weakens muscles and impacts physical function) in affected individuals.6 Dec 2022", "akilos-sp tablet": "Akilos-SP Tablet is a combination of three medicines: Aceclofenac, Paracetamol and Serratiopeptidase. Aceclofenac is a non-steroidal anti-inflammatory drug (NSAID), and Paracetamol is an antipyretic (fever reducer).22 Mar 2024", "amlozaar-h tablet": "Amlozaar-H Tablet is a combination of three medicines: Losartan, Amlodipine and Hydrochlorothiazide. Losartan is an angiotensin receptor blocker (ARB) and Amlodipine is a calcium channel blocker (CCB). They work by widening and relaxing the blood vessels, thereby lowering blood pressure.29 Nov 2023", "alight plus gel": "Alight Plus Gel 15gm for Acne Treatment - 1mg", "anaspas 25mg injection": "Anaspas 25mg Injection is a combination of two medicines: Camylofin and Diclofenac which relieve abdominal pain and cramps. Camylofin is an anticholinergic which relaxes the muscles in the stomach and gut (intestine). It stops sudden muscle contractions (spasms), thereby relieving cramps and pain.19 Feb 2024", "azibact lr 100 readymix": "Azibact LR 100 Readymix: View Uses, Side Effects, Price and ... - 1mg", "aquazide 25 tablet": "Product Summary", "amlodac 2.5 tablet": "Description:Amlodac 2.5 Tablet contains Amlodipine 2.5mg used to treat high blood pressure or hypertension.It also helps in the prevention of angina (chest pain due to heart problems)Chemical Class: Dihydropyridine Carboxylic acids derivatives.Addictive Drug: No.Therapeutic Class: Cardiac.", "amoxclav 500 mg/125 mg tablet": "The active substances are amoxicillin and clavulanic acid. Each film-coated tablet contains 500 mg amoxicillin (as amoxicillin trihydrate) and 125 mg clavulanic acid (as potassium clavulanate).", "amplinak opthalmic suspension": "AMPLINAK OPHTHALMIC SUSPENSION contains Nepafenac which belongs to the group of medicines called Ophthalmic anti-inflammatory agents. It is used in adults to treat and prevent eye pain and eye inflammation following cataract surgery.9 Nov 2022", "aplevant 1.5mg pre-filled pen (0.5ml each)": "Aplevant 1.5mg Pre-filled Pen (0.5ml Each) - 1mg", "ambrodil-xp syrup": "Ambrodil-XP Syrup comprises of theophylline-7 acetate and ambroxol which makes it effective in making the mucus more fluid and clearing the airways easily, thereby making breathing easier.", "arvast 10 tablet": "Arvast 10 Tablet contains Rosuvastatin 10mg used for the treatment of high cholesterol. Arvast 10 also helps in the prevention of heart diseases. Chemical Class: Phenylpyrimidine derivatives.", "ascoril flu drops": "Ascoril FLU Drop 15 ml contains Chlorpheniramine and Phenylephrine. Chlorpheniramine is an antiallergic which relieves allergy symptoms like runny nose, watery eyes and sneezing. Phenylephrine is a decongestant that narrows the small blood vessels, relieving the nose's congestion or stuffiness.", "atharv healthcare minrav 5 minoxidil 5% topical solution": "Atharv Healthcare Minrav 5 Minoxidil 5% Topical Solution - 1mg", "amoxyclav oral suspension": "Amoxyclav Oral Suspension comprises two active ingredients, amoxycillin and clavulanic acid. While clavulanic acid stops the enzyme from rendering amoxycillin ineffective, amoxycillin works towards killing the tuberculosis-causing bacteria.29 Nov 2023", "ata mont 20mg/10mg tablet": "Ata Mont 20mg/10mg Tablet is a combination of two medicines : Bilastine and Montelukast. Bilastine is an anti-allergic medication. It treats allergy symptoms such as itching, swelling, and rashes by blocking the effects of a chemical messenger (histamine) in the body.22 Mar 2024", "acimol 100 mg/325 mg tablet": "Acimol 100 mg/325 mg Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling).13 Feb 2024", "antidep 25mg tablet": "Antidep 25mg Tablet: View Uses, Side Effects, Price and Substitutes", "artificial tears bp eye drop": "Artificial Tears BP Eye Drop: View Uses, Side Effects, Price ... - 1mg", "almox 250 mg tablet dt": "Almox Dt 250 MG Description\n\n It contains amoxicillin, a semi-synthetic derivative of penicillin. Take this tablet as directed by the doctor. Some of the common side effects of this medicine include nausea, vomiting, diarrhoea and skin rashes.15 May 2023", "augpen hs 200 mg/28.5 mg suspension": "Augpen HS 200 mg/28.5 mg Suspension - 1mg", "anfoe 10000iu injection": "Anfoe 10000IU injection contains active components such as Recombinant human erythropoietin alfa/epoetin alfa. It is a medication that belongs to a class of drugs called erythropoiesis-stimulating agents (ESAs).6 Jan 2024", "acnovate gel": "Acnovate Gel is a combination of two medicines: Adapalene and Clindamycin, which treats pimples (acne). Adapalene is a form of vitamin A which prevents accumulation of the sebum (skin's natural oil), unblocks the pores and allows natural exfoliation of the outer layers of skin.", "anabel-ct gel": "Anabel-CT Gel: View Uses, Side Effects, Price and Substitutes | 1mg", "atorlip gold 20 capsule": "Atorlip Gold 20 Capsule: View Uses, Side Effects, Price and ... - 1mg", "azikem 250mg tablet": "Azikem 250mg Tablet: View Uses, Side Effects, Price and Substitutes", "acnetor ad gel": "Product Summary", "anthocyn-tx tablet": "Anthocyn-TX Tablet is a combination of two medicines : Tranexamic Acid and Glutathione. Tranexamic Acid is an anti-fibrinolytic that reduces the production of melanin (a pigment that gives the skin its color), by altering the activity of some enzymes that aid in melanin synthesis.29 Nov 2023", "antiblue 10mg tablet": "Antiblue 10mg Tablet: View Uses, Side Effects, Price and Substitutes", "ampiclox 250mg/250mg tablet": "Ampiclox 250mg/250mg Tablet is a combination of two antibiotics: Ampicillin and Cloxacillin. These antibiotics work by preventing the formation of the bacterial protective covering which is essential for the survival of bacteria. Together, they treat your infection effectively.29 Nov 2023", "af 300 tablet": "AF 300 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "acecloren tablet": "Acecloren Tablet contains a combination of three medicine, namely aceclofenac, paracetamol, and serratiopeptidase. Before using the medicine, inform the doctor if you are pregnant, planning a pregnancy or breastfeeding, and about detailed medical history.26 Oct 2023", "altonil 10 tablet": "Altonil 10 Tablet: View Uses, Side Effects, Price and Substitutes | 1mg", "atchol cv capsule": "Atchol CV Capsule is a combination of two medicines: Atorvastatin and Clopidogrel, which prevents heart attack and stroke.4 days ago", "absolut dm capsule": "Absolut DM Capsule 10's contains Benfotiamine, Alpha-lipoic acid, Pyridoxine hydrochloride, Folic acid, and Mecobalamin. Benfotiamine helps deliver essential nutrients to the nerves. Alpha-lipoic acid prevents cell damage and restores vitamin levels in the body. It also decreases pain and numbness in neuropathy.", "aztor ez tablet": "Aztor EZ Tablet 10's is a combination of two medicines: Atorvastatin (HMG-CoA reductase inhibitors (statins)) and Ezetimibe (sterol absorption inhibitor). Atorvastatin helps to decrease the production of cholesterol that may build up on the blood vessels (arteries) of the heart, brain, and other parts of the body.", "alfakit tablet": "Alfakit Tablet 10's contains “Alpha Ketoanalogue”, and it works by preventing the unnecessary increase in urea levels in the blood due to the intake of non-essential amino acids in patients with kidney failure. Thereby improving renal function.", "acotibien 100mg tablet": "ACOTIBIEN 100MG TABLET contains Acotiamide, which belongs to the group of medicines called Gastro-intestinal agents. It is used in the treatment of functional dyspepsia. Functional dyspepsia is a chronic functional disorder of the upper digestive system that affects sensation and movement.1 Dec 2022", "ad 10mg sachet": "AD 10MG SACHET contains Racecadotril which belongs to the group of medicines called Antidiarrheals. It is indicated in the treatment of acute diarrhoea in children over 3 months of age along with abundant liquid intake and the usual dietary measures.14 Nov 2022", "atormac tg tablet": "Atormac Tg Tablet contains atorvastatin and fenofibrate as active substances. Atorvastatin works by lowering bad cholesterol. Fenofibrate works by the breakdown of triglyceride fat present in blood.26 Oct 2023", "ambistryn-s 1gm injection": "Ambistryn S 1gm Injection 1's contains Streptomycin, primarily used to treat and prevent bacterial infections like tuberculosis (TB), pneumonia, influenza and plague. It is an antibiotic that prevents the production of an enzyme known as mycolic acids by bacteria essential for cell wall formation (protective coating).", "abmac tablet": "Abmac Tablet is a combination of three medicines: Acebrophylline, Desloratadine and Montelukast. Acebrophylline is a mucolytic which thins and loosens mucus (phlegm), making it easier to cough out. Desloratadine is an antiallergic which relieves allergy symptoms like runny nose, watery eyes and sneezing.29 Nov 2023", "acnedap plus gel": "Acnedap Plus Gel is a combination of two medicines: Dapsone and Adapalene which treat acne (pimples). Dapsone is an antibiotic which stops the bacteria from producing folic acid, a nutrient required for bacterial multiplication.", "anafortan n 100 mg/50 mg tablet": "Anafortan N 100 mg/50 mg Tablet - 1mg", "ascapil 12a tablet dt": "ASCAPIL 12A TABLET contains a combination of Albendazole and Ivermectin, which belongs to a group of medicines called Anthelmintics. It is used to treat parasitic and worm infestations. Parasitic worm infections are intestinal worm infections that are caused by the ingestion of contaminated food and water.21 Oct 2022", "addex 500mg ointment": "ADDEX 500MG OINTMENT contains Cadexomer Iodine which belongs to a group of medicines called Anti-Bacterial agents. It is used for the treatment of chronic exuding wounds such as leg ulcers, pressure ulcers, diabetic ulcers and infected traumatic and surgical wounds.14 Jan 2023", "afogatran 110 capsule": "Afogatran 110 Capsule: View Uses, Side Effects, Price and Substitutes", "alastin am tablet": "Alastin-AM tablet contains Loratadine, an anti-allergic drug that acts by stopping Histamine a chemical in blood from initiating allergic reaction & Ambroxol, a mucolytic drug that acts by breaking respiratory tract mucus into smaller pieces.", "amfy v  vaginal gel": "AMFY V GEL(TOPICAL) contains Amphotericin B which belongs to the group of medicines called Anti-fungal agents. AMFY V GEL(TOPICAL) is used to treat acute, chronic & recurrent fungal infections, vaginal candidiasis, diaper rash, and bed sores in affected individuals.22 Nov 2022", "ampoxin 250 capsule": "Ampoxin 250 Capsule contains two active ingredients: Ampicillin and Cloxacillin. Ampicillin works by preventing the formation of the bacterial protective covering (cell wall) which is essential for the survival of the bacteria.22 Mar 2024", "azibact lr readymix 200": "Azibact Lr 200mg Readymix contains azithromycin. It is a higher antibiotic.31 Jul 2020", "avanext 100mg tablet": "Avanext 100mg Tablet: View Uses, Side Effects, Price and Substitutes", "anti-thyrox 10 tablet": "Anti-Thyrox 10 Tablet: View Uses, Side Effects, Price and Substitutes", "aztor 80 tablet": "Aztor 80 tablet contains atorvastatin as the active ingredient. Atorvastatin is a member of the statin class of medicines, which are used to control lipid (fat) levels in the body. This medicine works by preventing the action of a chemical necessary for cholesterol formation.26 Oct 2023", "akair lc tablet": "Akair LC Tablet is a combination of two medicines: Levocetirizine and Montelukast, which relieves sneezing and runny nose due to allergies. Levocetirizine is an antiallergic which blocks a chemical messenger (histamine) responsible for runny nose, watery eyes and sneezing. Montelukast is a leukotriene antagonist.8 Mar 2024", "astymin-sn infusion": "The salts Glycine, L-Alanine, L-Arginine, L-Aspartic Acid, L-Cysteine, L-Glutamic Acid, L-Histidine, L-Isoleucine, L-Leucine, L-Lysine, L-Methionine, L-Phenylalamine, L-Proline, L-Serine, L-Threonine, L-Tryptophan, L-Tyrosine, L-Valine, Xylitol are involved in the preparation of Astymin Sn Infusion.", "asprito 2 tablet": "ASPRITO 2MG TABLET contains Aripiprazole which belongs to the group of medicines called Anti-psychotic drugs. It is used to treat schizophrenia, especially in the adolescent patients (aged between 13-17 years). Schizophrenia is a mental disorder which affects a person's ability to think, feel and behave correctly.24 Nov 2022", "asomex-at tablet": "Product Summary"}